[
  {
    "materials": "ToyFactory",
    "title": "Toy Factory (Set Models of Fractions)",
    "description": "Create a set of stuffed animals: monkeys, giraffes, and rabbits. Toys can be painted red, green, or blue. Describe the makeup of the set (animals or colors) with fractions. Arrange the toys into groups to simplify the fractions.",
    "resource": 1005,
    "answers": ["B", "C", "D", "B", "A"]
  },
  {
    "materials": "ModelWholeNumDec",
    "title": "Modeling Whole Numbers and Decimals (Base-10 Blocks)",
    "description": "Model numbers with base-10 blocks. Drag flats, rods, and individual cubes onto a mat to model a number. Blocks can be exchanged from one area of the mat to the other. Four sets of blocks are available to model a variety of whole numbers and decimals.",
    "resource": 1010,
    "answers": ["C", "D", "B", "A", "C"]
  },
  {
    "title": "Modeling Decimals (Area and Grid Models)",
    "materials": "ModelDecGrid",
    "description": "Model and compare decimals using area models. Set the number of sections in each model to 1, 10, or 100, and then click in the models to shade sections. Compare decimals visually and on a number line.",
    "resource": 1007,
    "answers": ["B", "D", "B", "C", "A"]
  },
  {
    "description": "Explore fractions using the Fractionator, the machine that makes fraction tiles. Compare fractions and find equivalent fractions by arranging the tiles on two horizontal rows. Explore simplifying fractions. Add fractions and express sums as improper fractions or mixed numbers.",
    "materials": "EquivFrac",
    "title": "Equivalent Fractions (Fraction Tiles)",
    "resource": 1012,
    "answers": ["B", "D", "A", "A", "C"]
  },
  {
    "materials": "FractionArtist1",
    "title": "Fraction Artist 1 (Area Models of Fractions)",
    "description": "Develop understanding of fractions by making modern paintings. Find different ways to divide a canvas into equal-sized sections. Make paintings to represent simple fractions and to find fractions that are equivalent to one-half.",
    "resource": 1038,
    "answers": ["B", "C", "A", "D", "B"]
  },
  {
    "description": "Model and compare fractions, decimals, and percents using area models. Each area model can have 10 or 100 sections and can be set to display a fraction, decimal, or percent. Click inside the area models to shade them. Compare the numbers visually or on a number line.",
    "title": "Fraction, Decimal, Percent (Area and Grid Models)",
    "materials": "FracDecPerc",
    "resource": 1008,
    "answers": ["D", "A", "D", "D", "C"]
  },
  {
    "materials": "NumberLineFrog",
    "title": "Number Line Frog Hop (Addition and Subtraction)",
    "description": "Live a frog's life as you hop along a number line in search of flies. Learn how addition and subtraction can be represented as movement along a number line. Fred the frog may even help you get better at adding and subtracting two-digit numbers in your head by decomposing them into tens and ones.",
    "resource": 1022,
    "answers": ["B", "B", "D", "C", "A"]
  },
  {
    "description": "Use base-10 blocks to model two numbers. Then combine the blocks to model the sum. Blocks of equal value can be exchanged from one area of the mat to the other to help understand carrying when adding. Four sets of blocks are available to model different place values.",
    "materials": "AddWholeNumDec",
    "title": "Adding Whole Numbers and Decimals (Base-10 Blocks)",
    "resource": 1023,
    "answers": ["B", "D", "C", "C", "C"]
  },
  {
    "description": "Use base-10 blocks to model a starting number. Then subtract blocks from this number by dragging them into a subtraction bin. Blocks of equal value can be exchanged from one section of the mat to the other to help understand regrouping and borrowing. Four sets of blocks are available to model different place values.",
    "materials": "SubtractWholeNumDec",
    "title": "Subtracting Whole Numbers and Decimals (Base-10 Blocks)",
    "resource": 1030,
    "answers": ["C", "B", "A", "D", "C"]
  },
  {
    "materials": "AddingFrac",
    "title": "Adding Fractions (Fraction Tiles)",
    "description": "Add fractions with the help of the Fractionator, a fraction-tile-making machine in the Gizmo. Model sums by placing the tiles on side-by-side number lines. Explore the usefulness of common denominators in adding. Express sums as improper fractions or mixed numbers.",
    "resource": 1027,
    "answers": ["B", "B", "D", "C", "D"]
  },
  {
    "title": "Fractions Greater than One (Fraction Tiles)",
    "materials": "FractionGreater1",
    "description": "Explore fractions greater than one with the Fractionator, a fraction-tile-making machine in the Gizmo. Create sums of fraction tiles on two number lines. Sums greater than one are shown as improper fractions on the top number line, and as mixed numbers on the bottom number line.",
    "resource": 1037,
    "answers": ["C", "A", "B", "C", "C"]
  },
  {
    "materials": "WholeNosBase10",
    "title": "Whole Numbers with Base-10 Blocks",
    "description": "Use base-10 blocks to model, add, and subtract whole numbers. Learn about place value using flats (hundreds), rods (tens), and cubes (ones). Group or ungroup blocks as needed to add or subtract. This regrouping is often called \"carrying\" when adding, and \"borrowing\" when subtracting.",
    "resource": 1200,
    "answers": ["D", "C", "D", "A", "B"]
  },
  {
    "title": "Modeling Fractions (Area Models)",
    "materials": "ModelFractions",
    "description": "Model and compare fractions using area models. Set the denominators with the arrow buttons, and then set the numerators with the arrow buttons or by clicking in the models. Compare fractions visually, on a number line, or numerically using the least common denominator.",
    "resource": 1006,
    "answers": ["C", "B", "A", "D", "C"]
  },
  {
    "materials": "FractionArtist2",
    "title": "Fraction Artist 2 (Area Models of Fractions)",
    "description": "Extend understanding of fractions by making modern paintings in the style of Piet Mondrian. Create and analyze paintings with different-sized sections. Compare the sizes of unit fractions. Find creative ways to color one-half of a painting. This can be a nice introduction to adding fractions with unlike denominators.",
    "resource": 1001,
    "answers": ["B", "A", "C", "A", "D"]
  },
  {
    "materials": "TargetSum",
    "title": "Target Sum Card Game (Multi-digit Addition)",
    "description": "Play an addition card game! The goal is to create a sum that is as close as possible to the target sum. Students will deepen their understanding of place value as they get better at playing the game. Many game options allow students to vary the game for more practice. The game can be played with one or two players.",
    "resource": 1020,
    "answers": ["D", "B", "B", "C", "D"]
  },
  {
    "description": "Use groups of critters on leaves to model multiplication as repeated addition. Change the expression to change the number of groups or the number of critters per group. Display the critters either on leaves or as a rectangular array.",
    "materials": "CritterCount",
    "title": "Critter Count (Modeling Multiplication)",
    "resource": 1013,
    "answers": ["C", "D", "C", "B", "A"]
  },
  {
    "description": "Go sightseeing in fictional cities all over the world. Learn about coordinates on a graph by navigating around these cities on a grid-like city map. Some landmarks are shown on the map. For others, you are only given the coordinates. Can you find all of them?",
    "materials": "CityTour",
    "title": "City Tour (Coordinates)",
    "resource": 1019,
    "answers": ["B", "A", "A", "B", "C"]
  },
  {
    "materials": "FunctionMachines1",
    "title": "Function Machines 1 (Functions and Tables)",
    "description": "Drop a number into a function machine, and see what number comes out! You can use one of the six pre-set function machines, or program your own function rule into one of the blank machines. Stack up to three function machines together. Input and output can be recorded in a table and on a graph.",
    "resource": 1035,
    "answers": ["D", "B", "C", "A", "C"]
  },
  {
    "title": "Multiplying Decimals (Area Model)",
    "materials": "MultDec",
    "description": "Model the product of two decimals by finding the area of a rectangle. Estimate the area of the rectangle first. Then break the rectangle into several pieces and find the area of each piece (partial product). Add these areas together to find the whole area (product).",
    "resource": 1026,
    "answers": ["B", "C", "A", "C", "A"]
  },
  {
    "description": "The Factor Trees Gizmo has two modes. In Factor mode, you can create factor trees to factor composite numbers into primes. In Build mode, you can build numbers by multiplying primes together. Can you build all composite numbers up to 50? Any whole composite number up to 999 can be factored or built with the Gizmo.",
    "materials": "FactorTrees",
    "title": "Factor Trees (Factoring Numbers)",
    "resource": 1033,
    "answers": ["B", "B", "D", "A", "A"]
  },
  {
    "description": "You are the captain of an interplanetary cargo ship, delivering important supplies to the outer planets. The cargo can be stored in barrels, crates, and holds. (There are 10 barrels in a crate, and 10 crates in a hold.) Model multi-digit subtraction by unloading cargo on each planet.",
    "materials": "CargoCaptain",
    "title": "Cargo Captain (Multi-digit Subtraction)",
    "resource": 1021,
    "answers": ["C", "B", "B", "C", "D"]
  },
  {
    "description": "The alien school children from the planet Zigmo travel to distant planets on a field trip. The goal is to select a bus size so that all buses are full and no aliens are left behind. This is a nice illustration of division with remainders.",
    "materials": "NoAlienLeftBehind",
    "title": "No Alien Left Behind (Division with Remainders)",
    "resource": 1002,
    "answers": ["B", "D", "A", "C", "B"]
  },
  {
    "title": "Rounding Whole Numbers (Number Line)",
    "materials": "Rounding",
    "description": "Place points on a number line. Round these values to the nearest ten or hundred. Visualize rounding by showing the number line as a hill or series of hills. These hills cause the points to roll to the nearest valley (nearest multiple of ten or one hundred).",
    "resource": 1024,
    "answers": ["A", "C", "A", "B", "B"]
  },
  {
    "description": "Plant flowers in two gardens to help develop fraction sense. The two gardens act as number lines, from 0 to 1. Use the flowers in the gardens to compare fractions and to explore equivalent fractions. Chalk marks can be drawn to divide the garden into equal sections.",
    "materials": "FractionGarden",
    "title": "Fraction Garden (Comparing Fractions)",
    "resource": 1004,
    "answers": ["C", "D", "A", "B", "C"]
  },
  {
    "materials": "TreasureHunter",
    "title": "Treasure Hunter (Decimals on the Number Line)",
    "description": "Drive a desert highway searching for buried treasure. Learn to use the car's tens, ones, tenths, and hundredths gears, along with a GPS system (number line), to find the right place to dig. Plot your find on a zoomable number line map. Can you become a master Treasure Hunter?",
    "resource": 1003,
    "answers": ["D", "B", "B", "B", "D"]
  },
  {
    "materials": "FunctionMachines2",
    "title": "Function Machines 2 (Functions, Tables, and Graphs)",
    "description": "Drop a number into a function machine, and see what number comes out! You can use one of the six pre-set function machines, or program your own function rule into one of the blank machines. Stack up to three function machines together. Input and output can be recorded in a table and on a graph.",
    "resource": 1039,
    "answers": ["A", "D", "C", "A", "B"]
  },
  {
    "materials": "QuiltingBee",
    "title": "Quilting Bee (Symmetry)",
    "description": "Participate in an old-fashioned quilting bee and create a colorful, symmetrical quilt. Quilts can be created with a vertical, horizontal, or diagonal line of symmetry. Quilts can be folded to look for reflections, or rotated to test for rotational symmetry.",
    "resource": 1016,
    "answers": ["A", "B", "B", "B", "C"]
  },
  {
    "materials": "FunctionMachines3",
    "title": "Function Machines 3 (Functions and Problem Solving)",
    "description": "Drop a number into a function machine, and see what number comes out! You can use one of the six pre-set function machines, or program your own function rule into one of the blank machines. Stack up to three function machines together. Input and output can be recorded in a table and on a graph.",
    "resource": 1040,
    "answers": ["C", "B", "C", "A", "A"]
  },
  {
    "description": "Launch clowns from a circus cannon and try to hit the target. Drag digit cards on the control panel to set the launch distance and choose an appropriate unit of distance. After practicing your clown-launching skills on a number line, move on to the Big Top, Football Field, School Buses, the Golden Gate Bridge, and more!",
    "materials": "Clowns",
    "title": "Cannonball Clowns (Number Line Estimation)",
    "resource": 1025,
    "answers": ["C", "B", "D", "D", "C"]
  },
  {
    "description": "Use the Chocomatic to design candy bars made out of chocolate squares. Use multiplication to find the number of squares in each chocolate bar. Build collections of chocolate bars that all have the same number of squares. Solve multiplication problems by joining two smaller chocolate bars into a large bar.",
    "title": "Chocomatic (Multiplication, Arrays, and Area)",
    "materials": "Chocomatic",
    "resource": 1014,
    "answers": ["C", "B", "A", "C", "D"]
  },
  {
    "materials": "RoadTrip",
    "title": "Road Trip (Problem Solving)",
    "description": "Plan a cross-country road trip through various U.S. state capitals. First choose a vehicle to drive, and then fill up the tank with gas and go! Find the range and gas mileage of each vehicle, and discover the shortest path between two cities.",
    "resource": 1036,
    "answers": ["D", "D", "C", "A", "C"]
  },
  {
    "materials": "FidosFlowerBed",
    "title": "Fido's Flower Bed (Perimeter and Area)",
    "description": "Construct models of gardens on a grid using squares of sod. Fence the gardens to find and compare perimeters. Work with pre-built gardens made of 36 squares each to compare perimeters of shapes with equal areas.",
    "resource": 1011,
    "answers": ["B", "B", "C", "D", "B"]
  },
  {
    "description": "This Gizmo provides you with two challenges. First, use blocks to build a figure with a given volume. Then, try to balance the blocks on a platform that sits on the tip of a cone. The dimensions of the platform can be adjusted, and blocks can be added or deleted by clicking on the model.",
    "materials": "BalancingBlocks",
    "title": "Balancing Blocks (Volume)",
    "resource": 1032,
    "answers": ["C", "A", "B", "C", "D"]
  },
  {
    "materials": "RockArt",
    "title": "Rock Art (Transformations)",
    "description": "Create your own rock art with ancient symbols. Each symbol can be translated, rotated, and reflected. After exploring each type of transformation, see if you can use them to match ancient rock paintings.",
    "resource": 1031,
    "answers": ["B", "D", "A", "B", "A"]
  },
  {
    "materials": "MovieRev",
    "description": "Movie reviewers rate movies on a scale of 0 to 10. Each movie comes with a set of reviews that can be changed by the user. The mean of a data set can be explored using a see-saw balance model. Students can also find the median, mode, and range of the data set.",
    "title": "Movie Reviewer (Mean and Median)",
    "resource": 1018,
    "answers": ["B", "B", "C", "B", "A"]
  },
  {
    "description": "Operate an elevator in an old apartment building. Pick up and drop off residents where they want to go. A line graph shows where the elevator traveled over time. Operate the elevator either by using the standard up and down controls, or by building a graph to program where you want it to go.",
    "title": "Elevator Operator (Line Graphs)",
    "materials": "Elevator",
    "resource": 1017,
    "answers": ["A", "C", "D", "B", "A"]
  },
  {
    "title": "Mascot Election (Pictographs and Bar Graphs)",
    "materials": "Mascot",
    "description": "A brand new school is opening and it is time to elect the school mascot! Students can choose the Eagle, Lion, Bear, or Wolf. Voting results can be displayed in a table, tally chart, pictograph, bar graph, circle graph, or dot plot. You can change student votes by selecting a group of students and clicking a mascot.",
    "resource": 1029,
    "answers": ["D", "B", "A", "C", "D"]
  },
  {
    "description": "Step right up! Spin the big wheel! Each spin can result in no prize, a small prize, or a big prize. The wheel can be spun by 1, 10, or 100 players. Results are recorded on a frequency table or a circle graph. You can also design your own wheel and a sign that describes the probabilities for your wheel.",
    "materials": "SpinWheel",
    "title": "Spin the Big Wheel! (Probability)",
    "resource": 1015,
    "answers": ["C", "B", "A", "D", "A"]
  },
  {
    "description": "Test your reaction time by catching a falling ruler or clicking a target. Create a data set of experiment results, and calculate the range, mode, median, and mean of your data. Data can be displayed on a list, table, bar graph or dot plot. The Reaction Time 2 Student Exploration focuses on mean.",
    "materials": "ReactionTime2",
    "title": "Reaction Time 2 (Graphs and Statistics)",
    "resource": 1009,
    "answers": ["B", "B", "C", "B", "D"]
  },
  {
    "materials": "AddSubtractIntegers",
    "title": "Adding and Subtracting Integers",
    "description": "Add and subtract integers on a number line using dynamic arrows.",
    "resource": 291,
    "answers": ["C", "A", "D", "B", "D"]
  },
  {
    "materials": "FindingPatterns",
    "title": "Finding Patterns",
    "description": "Build a pattern to complete a sequence of patterns. Study a sequence of three patterns of squares in a grid and build the fourth pattern of the sequence in a grid.",
    "resource": 219,
    "answers": ["D", "B", "B", "C", "C"]
  },
  {
    "materials": "IntegersOppsAbsVals",
    "title": "Integers, Opposites, and Absolute Values",
    "description": "Compare and order integers using draggable points on a number line. Also explore opposites and absolute values on the number line.",
    "resource": 210,
    "answers": ["B", "D", "C", "B", "B"]
  },
  {
    "description": "Use grids to model decimal numbers and compare them graphically. Then compare the numbers on a number line.",
    "materials": "CompOrdDec",
    "title": "Comparing and Ordering Decimals",
    "resource": 208,
    "answers": ["D", "B", "A", "B", "C"]
  },
  {
    "materials": "OrderSquareRoots",
    "title": "Ordering and Approximating Square Roots",
    "description": "Order square roots on a number line. Approximate the square roots using the side lengths of square regions in a grid.",
    "resource": 230,
    "answers": ["D", "C", "D", "C", "B"]
  },
  {
    "title": "Sums and Differences with Decimals",
    "materials": "SumDiffDec",
    "description": "Find the sum or difference of two decimal numbers using area models. Find the decimals and their sum or difference on a number line.",
    "resource": 237,
    "answers": ["D", "B", "D", "A", "A"]
  },
  {
    "materials": "SquareRoots",
    "title": "Square Roots",
    "description": "Explore the meaning of square roots using an area model. Use the side length of a square to find the square root of a decimal number or a whole number.",
    "resource": 103,
    "answers": ["B", "B", "D", "C", "D"]
  },
  {
    "title": "Multiplying Fractions",
    "description": "Multiply two fractions using an area model. Vary the vertical area to change one fraction and vary the horizontal area to change the other. Then examine the intersection of the areas to find the product.",
    "materials": "MultFrac",
    "resource": 344,
    "answers": ["D", "B", "C", "B", "D"]
  },
  {
    "materials": "DivMixNum",
    "title": "Dividing Mixed Numbers",
    "description": "Choose the correct steps to divide mixed numbers. Use step-by-step feedback to diagnose and correct incorrect steps.",
    "resource": 213,
    "answers": ["B", "D", "C", "A", "B"]
  },
  {
    "materials": "MultMixNum",
    "title": "Multiplying Mixed Numbers",
    "description": "Choose the correct steps to multiply mixed numbers. Use the step-by-step feedback to diagnose incorrect steps.",
    "resource": 227,
    "answers": ["A", "B", "D", "B", "C"]
  },
  {
    "materials": "EstSumDiff",
    "title": "Estimating Sums and Differences",
    "description": "Estimate the sum or difference of two fractions using area models. Compare estimates to exact sums and differences.",
    "resource": 215,
    "answers": ["C", "B", "A", "D", "C"]
  },
  {
    "materials": "AddingNumberLine",
    "title": "Adding on the Number Line",
    "description": "Add real numbers using dynamic arrows on a number line. Find the sum of the numbers at the end of the final arrow. Compare the numerical calculation.",
    "resource": 95,
    "answers": ["B", "A", "C", "D", "B"]
  },
  {
    "description": "Represent a quantity given by a shaded region as an improper fraction and as a mixed number. Experiment with different shaded regions sliced differently.",
    "title": "Improper Fractions and Mixed Numbers",
    "materials": "ImpFracMixNum",
    "resource": 252,
    "answers": ["B", "C", "A", "D", "B"]
  },
  {
    "materials": "FracUnlikeDen",
    "title": "Fractions with Unlike Denominators",
    "description": "Find the sum or difference of two fractions with unlike denominators using graphic models. Find the least common denominator graphically.",
    "resource": 220,
    "answers": ["C", "B", "B", "C", "C"]
  },
  {
    "title": "Finding Factors with Area Models",
    "materials": "FindFactAreaModels",
    "description": "Find factors of a number using an area model. Reshape the area rectangle to see different factorizations of the number. Find the prime factorization using a factor tree.",
    "resource": 218,
    "answers": ["C", "B", "B", "D", "D"]
  },
  {
    "description": "Use chips to model addition and subtraction of positives and negatives. Explore the effect of zero pairs. See how to use zero pairs to help special cases of addition and subtraction.",
    "materials": "AddSubtractChips",
    "title": "Adding and Subtracting Integers with Chips",
    "resource": 599,
    "answers": ["A", "B", "D", "C", "D"]
  },
  {
    "description": "Test your reaction time by catching a falling ruler or clicking a target. Create a data set of experiment results, and calculate the range, mode, median, and mean of your data. Data can be displayed on a list, table, bar graph or dot plot. The Reaction Time 1 Student Exploration focuses on range, mode, and median.",
    "materials": "ReactionTime1",
    "title": "Reaction Time 1 (Graphs and Statistics)",
    "resource": 1028,
    "answers": ["B", "D", "A", "C", "D"]
  },
  {
    "description": "Use a number line to compare rational numbers. Change values by dragging points on the number line. Compare the opposites and absolute values of the numbers.",
    "materials": "RationalsOppsAbsVals",
    "title": "Rational Numbers, Opposites, and Absolute Values",
    "resource": 165,
    "answers": ["C", "D", "C", "C", "D"]
  },
  {
    "materials": "ProportionsCommonMult",
    "title": "Proportions and Common Multipliers",
    "description": "Complete a proportion using a graphical model. Use counters to fill cells in the numerators and denominators given. Use the visual pattern to determine how many counters to put in the missing numerator or denominator.",
    "resource": 268,
    "answers": ["B", "C", "D", "B", "A"]
  },
  {
    "materials": "OrdPercFracDec",
    "title": "Ordering Percents, Fractions, and Decimals Greater Than 1",
    "description": "Compare and order numbers greater than 1 using area grids and a number line. Examine the numbers represented as percents, improper fractions, and decimals.",
    "resource": 306,
    "answers": ["C", "B", "D", "B", "D"]
  },
  {
    "materials": "PartWholeRatios",
    "title": "Part-to-part and Part-to-whole Ratios",
    "description": "Compare a ratio represented by an area with its percent, fraction, and decimal forms.",
    "resource": 264,
    "answers": ["B", "C", "A", "B", "C"]
  },
  {
    "materials": "PercentsProportions",
    "title": "Percents and Proportions",
    "description": "Find a part from the percent and whole, a percent from the part and whole, or a whole from the part and percent using a graphic model.",
    "resource": 266,
    "answers": ["C", "A", "C", "D", "C"]
  },
  {
    "materials": "PercFracDec",
    "title": "Percents, Fractions, and Decimals",
    "description": "Compare a quantity represented by an area with its percent, fraction, and decimal forms.",
    "resource": 231,
    "answers": ["C", "B", "B", "C", "C"]
  },
  {
    "materials": "PercentChange",
    "title": "Percent of Change",
    "description": "Apply markups and discounts using interactive \"percent rulers.\" Improve number sense for percents with this dynamic, visual tool. Reinforce the original cost (or original price) as the baseline for percent calculations.",
    "resource": 265,
    "answers": ["B", "C", "C", "B", "A"]
  },
  {
    "title": "Dividing Exponential Expressions",
    "materials": "DivExp",
    "description": "Choose the correct steps to divide exponential expressions. Use the feedback to diagnose incorrect steps.",
    "resource": 342,
    "answers": ["D", "D", "C", "B", "B"]
  },
  {
    "materials": "ElapsedTime",
    "title": "Elapsed Time",
    "description": "Calculate the difference between the times given by two analog clocks. Rotate the hands of the clocks to change the time and see how the calculation changes.",
    "resource": 214,
    "answers": ["B", "B", "C", "C", "D"]
  },
  {
    "materials": "ExpPowRule",
    "title": "Exponents and Power Rules",
    "description": "Choose the correct steps to simplify expressions with exponents using the rules of exponents and powers. Use feedback to diagnose incorrect steps.",
    "resource": 305,
    "answers": ["B", "D", "C", "D", "D"]
  },
  {
    "title": "Multiplying Exponential Expressions",
    "materials": "MultExp",
    "description": "Choose the correct steps to multiply exponential expressions. Use the feedback to diagnose incorrect steps.",
    "resource": 343,
    "answers": ["A", "D", "B", "B", "B"]
  },
  {
    "materials": "NumberSystems",
    "title": "Number Systems",
    "description": "Explore number systems and convert numbers from one base to another using counter beads in place-value columns.",
    "resource": 302,
    "answers": ["B", "A", "C", "A", "C"]
  },
  {
    "description": "Grumpy’s Restaurant is now hiring! As a new chef at this underwater bistro, you’ll learn the basics of manipulating algebraic expressions. Learn how to make equivalent expressions using the Commutative and Associative properties, how to handle pesky subtraction and division, and how to identify equivalent and non-equivalent expressions.",
    "title": "Equivalent Algebraic Expressions I",
    "resource": 2001,
    "materials": "",
    "answers": []
  },
  {
    "materials": "MultiplyingDecimals",
    "title": "Multiplying with Decimals",
    "description": "Multiply two decimals using a dynamic area model. On a grid, shade the region with width equal to one of the decimals and height equal to the other decimal and find the area of the region.",
    "resource": 228,
    "answers": ["A", "D", "B", "A", "C"]
  },
  {
    "description": "Will you adopt Spidro, Centeon, or Ping Bee? They're three very different critters with one thing in common: a hunger for simplified algebraic expressions! Learn how the distributive property can be used to combine variable terms, producing expressions that will help your pet grow up healthy and strong. You'll become a pro at identifying terms that can be combined – even terms with exponents and multiple variables. With enough practice, you and your pet will be ready for the competitive expression eating circuit. Good luck!",
    "materials": "SimplifyingAlgebraicExpressions2",
    "title": "Simplifying Algebraic Expressions II",
    "resource": 2004,
    "answers": []
  },
  {
    "materials": "SimplifyingAlgebraicExpressions1",
    "title": "Simplifying Algebraic Expressions I",
    "description": "Meet Spidro, a quirky critter with an appetite for algebraic expressions! As Spidro's adopted owner, it's your responsibility to feed him so that he grows into… whatever it is that a Spidro grows into. But be careful - Spidro is a picky eater who prefers his food to be as simple as possible. Use the commutative property, distributive property, and the other properties of addition and multiplication to put expressions in simplest (and tastiest) form.",
    "resource": 2003,
    "answers": []
  },
  {
    "title": "Dividing Fractions",
    "description": "Divide fractions using area models. Adjust the numerators and denominators of the divisor and dividend and see how the area model and calculation change.",
    "materials": "DivFrac",
    "resource": 212,
    "answers": ["C", "D", "D", "D", "C"]
  },
  {
    "materials": "SolvingAlgebraicEquations2",
    "title": "Solving Algebraic Equations II",
    "description": "Is solving equations tricky? If you know how to isolate a variable, you're halfway there. The other half? Don't do anything to upset the balance of an equation. Join our plucky variable friend as he encounters algebraic equations and a (sometimes grumpy) equal sign. With a little practice, you'll find that solving equations isn't tricky at all.",
    "resource": 2006,
    "answers": []
  },
  {
    "materials": "PtsComplexPlane",
    "title": "Points in the Complex Plane",
    "description": "Identify the imaginary and real coordinates of a point in the complex plane. Drag the point in the plane and investigate how the coordinates change in response.",
    "resource": 147,
    "answers": ["C", "A", "C", "B", "A"]
  },
  {
    "title": "Equivalent Algebraic Expressions II",
    "description": "Continue your meteoric rise in the undersea culinary world in this follow-up to Equivalent Algebraic Expressions I. Make equivalent expressions by using the distributive property forwards and backwards, sort expressions by equivalence, and personally assist Chef Grumpy himself with a project that will bring him (and maybe you) fame and fortune.",
    "resource": 2002,
    "materials": "",
    "answers": []
  },
  {
    "title": "Using Algebraic Expressions",
    "description": "Translate algebraic expressions into English phrases, and translate English phrases into algebraic expressions. Read the expression or phrase and select word tiles or symbol tiles to form the corresponding phrase or expression.",
    "materials": "AlgExp",
    "resource": 257,
    "answers": ["D", "B", "B", "C", "B"]
  },
  {
    "materials": "SolvingAlgebraicEquations1",
    "title": "Solving Algebraic Equations I",
    "description": "Are there times when you wish you could escape from everyone and just be alone? Meet our variable friend, a real loner who doesn't like coefficients and neighboring terms. Learn how to use inverses to isolate a variable – a foundational skill for solving algebraic equations.",
    "resource": 2005,
    "answers": []
  },
  {
    "description": "Select and evaluate the operations in an expression following the correct order of operations.",
    "materials": "OrderOps",
    "title": "Order of Operations",
    "resource": 255,
    "answers": ["B", "C", "A", "D", "B"]
  },
  {
    "title": "Using Algebraic Equations",
    "description": "Translate equations into English sentences and translate English sentences into equations. Read the equation or sentence and select word tiles or symbol tiles to form the corresponding sentence or equation.",
    "materials": "AlgEq",
    "resource": 123,
    "answers": ["C", "A", "C", "B", "A"]
  },
  {
    "materials": "TwoStepEq",
    "description": "Solve a two-step equation using a cup-and-counter model. Use step-by-step feedback to diagnose and correct incorrect steps.",
    "title": "Modeling and Solving Two-Step Equations",
    "resource": 226,
    "answers": ["D", "C", "D", "B", "D"]
  },
  {
    "title": "Solving Equations by Graphing Each Side",
    "materials": "SolvEqGraph",
    "description": "Solve an equation by graphing each side and finding the intersection of the lines. Vary the coefficients in the equation and explore how the graph changes in response.",
    "resource": 158,
    "answers": ["B", "A", "C", "B", "B"]
  },
  {
    "materials": "SolvTwoStepEq",
    "title": "Solving Two-Step Equations",
    "description": "Choose the correct steps to solve a two-step equation. Use the feedback to diagnose incorrect steps.",
    "resource": 274,
    "answers": ["D", "C", "C", "A", "D"]
  },
  {
    "title": "Solving Formulas for any Variable",
    "materials": "SolvForm",
    "description": "Choose the correct steps to solve a formula for a given variable. Use the feedback to diagnose incorrect steps.",
    "resource": 309,
    "answers": ["A", "D", "B", "B", "D"]
  },
  {
    "materials": "LinearFunctions",
    "title": "Linear Functions",
    "description": "Determine if a relation is a function from the mapping diagram, ordered pairs, or graph. Use the graph to determine if it is linear.",
    "resource": 216,
    "answers": ["D", "C", "B", "C", "A"]
  },
  {
    "title": "Solving Equations on the Number Line",
    "materials": "SolveEquaNumLine",
    "description": "Solve an equation involving decimals using dynamic arrows on a number line.",
    "resource": 347,
    "answers": ["B", "A", "C", "A", "D"]
  },
  {
    "description": "Explore compound interest in-depth, from compounded annually to compounded continuously. In addition, compare the END POINTS graph, with dots that fit an exponential curve, to the ALL TIME graph, which has a more step-like appearance.",
    "materials": "CompoundInterest",
    "title": "Compound Interest",
    "resource": 272,
    "answers": ["B", "D", "C", "D", "C"]
  },
  {
    "materials": "PointSlope",
    "title": "Point-Slope Form of a Line",
    "description": "Compare the point-slope form of a linear equation to its graph. Vary the coefficients and explore how the graph changes in response.",
    "resource": 164,
    "answers": ["C", "A", "D", "A", "A"]
  },
  {
    "materials": "SlopeInt",
    "title": "Slope-Intercept Form of a Line",
    "description": "Compare the slope-intercept form of a linear equation to its graph. Vary the coefficients and explore how the graph changes in response.",
    "resource": 166,
    "answers": ["C", "D", "A", "C", "A"]
  },
  {
    "materials": "PtsCoordPlane",
    "title": "Points in the Coordinate Plane",
    "description": "Identify the coordinates of a point in the coordinate plane. Drag the point in the plane and investigate how the coordinates change in response.",
    "resource": 114,
    "answers": ["D", "C", "A", "D", "B"]
  },
  {
    "materials": "IntroFunc",
    "title": "Introduction to Functions",
    "description": "Determine if a relation is a function using the mapping diagram, ordered pairs, or the graph of the relation. Drag arrows from the domain to the range, type in ordered pairs, or drag points to the graph to add inputs and outputs to the relation.",
    "resource": 133,
    "answers": ["C", "B", "D", "D", "C"]
  },
  {
    "materials": "PointsLinesEquations",
    "title": "Points, Lines, and Equations",
    "description": "Compare the graph of a linear function to its rule and to a table of its values. Change the function by dragging two points on the line. Examine how the rule and table change.",
    "resource": 275,
    "answers": ["C", "A", "B", "C", "A"]
  },
  {
    "materials": "Slope",
    "title": "Slope",
    "description": "Explore the slope of a line, and learn how to calculate slope. Adjust the line by moving points that are on the line, and see how its slope changes.",
    "resource": 102,
    "answers": ["B", "D", "B", "C", "A"]
  },
  {
    "materials": "StandardFormLine",
    "title": "Standard Form of a Line",
    "description": "Compare the standard form of a linear equation to its graph. Vary the coefficients and explore how the graph changes in response.",
    "resource": 159,
    "answers": ["B", "C", "D", "B", "C"]
  },
  {
    "description": "Solve inequalities in one variable. Examine the inequality on a number line and determine which points are solutions to the inequality.",
    "materials": "LinearInequal",
    "title": "Exploring Linear Inequalities in One Variable",
    "resource": 273,
    "answers": ["A", "B", "D", "A", "C"]
  },
  {
    "title": "Solving Linear Inequalities in One Variable",
    "materials": "SolveLinearIneq",
    "description": "Solve one-step inequalities in one variable. Graph the solution on a number line.",
    "resource": 119,
    "answers": ["C", "B", "D", "D", "B"]
  },
  {
    "description": "Experiment with a system of two lines representing a cat-and-mouse chase. Adjust the speeds of the cat and mouse and the head start of the mouse, and immediately see the effects on the graph and on the chase. Connect real-world meaning to slope, y-intercept, and the intersection of lines.",
    "materials": "CatMouseMetric",
    "title": "Cat and Mouse (Modeling with Linear Systems) - Metric",
    "resource": 623,
    "answers": ["C", "B", "A", "B", "B"]
  },
  {
    "title": "Systems of Linear Inequalities (Slope-intercept form)",
    "materials": "SysLinearIneq",
    "description": "Compare a system of linear inequalities to its graph. Vary the coefficients and inequality symbols in the system and explore how the boundary lines, shaded regions, and the intersection of the shaded regions change in response.",
    "resource": 162,
    "answers": ["C", "A", "D", "C", "C"]
  },
  {
    "description": "Use the graph of the feasible region to find the maximum or minimum value of the objective function. Vary the coefficients of the objective function and vary the constraints. Explore how the graph of the feasible region changes in response.",
    "materials": "LinearProg",
    "title": "Linear Programming",
    "resource": 143,
    "answers": ["D", "B", "A", "C", "C"]
  },
  {
    "title": "Solving Linear Systems (Standard Form)",
    "description": "Solve systems of linear equations, written in standard form. Explore what it means to solve systems algebraically (with substitution or elimination) and graphically. Also, use a draggable green point to see what it means when (x, y) values are solutions of an equation, or of a system of equations.",
    "materials": "LinSysStdForm",
    "resource": 121,
    "answers": ["C", "A", "A", "C", "C"]
  },
  {
    "title": "Solving Linear Systems (Matrices and Special Solutions)",
    "materials": "LinSysMatrices",
    "description": "Explore systems of linear equations, and how many solutions a system can have. Express systems in matrix form. See how the determinant of the coefficient matrix reveals how many solutions a system of equations has. Also, use a draggable green point to see what it means for an (x, y) point to be a solution of an equation, or of a system of equations.",
    "resource": 161,
    "answers": ["A", "B", "B", "D", "B"]
  },
  {
    "title": "Solving Linear Systems (Slope-Intercept Form)",
    "description": "Solve systems of linear equations, given in slope-intercept form, both graphically and algebraically. Use a draggable green point to examine what it means for an (x, y) point to be a solution of one equation, or of a system of two equations.",
    "materials": "LinSysSlopeInt",
    "resource": 120,
    "answers": ["B", "D", "D", "D", "A"]
  },
  {
    "description": "Explore the graphs of two inequalities and find their union or intersection. Determine the relationship between the endpoints of the inequalities and the endpoints of the compound inequality.",
    "materials": "CompoundInequal",
    "title": "Compound Inequalities",
    "resource": 99,
    "answers": ["B", "C", "A", "D", "A"]
  },
  {
    "description": "Experiment with a system of two lines representing a cat-and-mouse chase. Adjust the speeds of the cat and mouse and the head start of the mouse, and immediately see the effects on the graph and on the chase. Connect real-world meaning to slope, y-intercept, and the intersection of lines.",
    "materials": "CatMouse",
    "title": "Cat and Mouse (Modeling with Linear Systems)",
    "resource": 108,
    "answers": ["C", "B", "A", "B", "B"]
  },
  {
    "materials": "ZapIt",
    "title": "Zap It! Game",
    "description": "Adjust the values in a quadratic function, in vertex form or in polynomial form, to \"zap\" as many data points as possible.",
    "resource": 93,
    "answers": ["D", "B", "C", "A", "B"]
  },
  {
    "materials": "RootsQuadratic",
    "title": "Roots of a Quadratic",
    "description": "Find the root of a quadratic using its graph or the quadratic formula. Explore the graph of the roots and the point of symmetry in the complex plane. Compare the axis of symmetry and graph of the quadratic in the real plane.",
    "resource": 154,
    "answers": ["C", "A", "C", "B", "D"]
  },
  {
    "materials": "LinearIneq2Var",
    "title": "Linear Inequalities in Two Variables",
    "description": "Find the solution set to a linear inequality in two variables using the graph of the linear inequality. Vary the terms of the inequality and vary the inequality symbol. Examine how the boundary line and shaded region change in response.",
    "resource": 142,
    "answers": ["B", "C", "B", "B", "C"]
  },
  {
    "materials": "QuadraticVertexForm",
    "title": "Quadratics in Vertex Form",
    "description": "Compare the graph of a quadratic to its equation in vertex form. Vary the terms of the equation and explore how the graph changes in response.",
    "resource": 150,
    "answers": ["A", "C", "C", "C", "D"]
  },
  {
    "title": "Quadratics in Polynomial Form",
    "materials": "QuadPoly",
    "description": "Compare the graph of a quadratic to its equation in polynomial form. Vary the coefficients of the equation and explore how the graph changes in response.",
    "resource": 116,
    "answers": ["A", "A", "D", "B", "A"]
  },
  {
    "description": "Solve a linear equation using a tile model. Use feedback to diagnose incorrect steps.",
    "materials": "OneStepEq",
    "title": "Modeling One-Step Equations",
    "resource": 109,
    "answers": ["A", "C", "B", "A", "C"]
  },
  {
    "title": "Quadratic Inequalities",
    "materials": "QuadInequal",
    "description": "Find the solution set to a quadratic inequality using its graph. Vary the terms of the inequality and the inequality symbol. Examine how the boundary curve and shaded region change in response.",
    "resource": 149,
    "answers": ["A", "C", "C", "D", "C"]
  },
  {
    "title": "Quadratics in Factored Form",
    "materials": "QuadraticFactored",
    "description": "Investigate the factors of a quadratic through its graph and through its equation. Vary the roots of the quadratic and examine how the graph and the equation change in response.",
    "resource": 115,
    "answers": ["D", "D", "B", "C", "B"]
  },
  {
    "materials": "OpRadExp",
    "title": "Operations with Radical Expressions",
    "description": "Identify the correct steps to complete operations with a radical expression. Use step-by-step feedback to diagnose incorrect steps.",
    "resource": 112,
    "answers": ["A", "C", "B", "C", "D"]
  },
  {
    "materials": "RadicalFunctions",
    "title": "Radical Functions",
    "description": "Compare the graph of a radical function to its equation. Vary the terms of the equation. Explore how the graph is translated and stretched by the changes to the equation.",
    "resource": 151,
    "answers": ["C", "A", "A", "B", "D"]
  },
  {
    "materials": "LogFunc",
    "title": "Logarithmic Functions",
    "description": "Compare the equation of a logarithmic function to its graph. Change the base of the logarithmic function and examine how the graph changes in response. Use the line y = x to compare the associated exponential function.",
    "resource": 145,
    "answers": ["D", "D", "B", "A", "A"]
  },
  {
    "title": "Exponential Growth and Decay",
    "description": "Explore the graph of the exponential growth or decay function. Vary the initial amount and the rate of growth or decay and investigate the changes to the graph.",
    "materials": "ExpGrowthDecay",
    "resource": 105,
    "answers": ["A", "C", "B", "D", "B"]
  },
  {
    "materials": "RationalFctns",
    "title": "Rational Functions",
    "description": "Compare the graph of a rational function to its equation. Vary the terms of the equation and explore how the graph is translated and stretched as a result. Examine the domain on a number line and compare it to the graph of the equation.",
    "resource": 152,
    "answers": ["A", "B", "A", "D", "B"]
  },
  {
    "description": "Solve an inequality involving absolute values using a graph of the absolute-value function. Vary the terms of the absolute-value function and vary the value that you are comparing it to. Then explore how the graph and solution set change in response.",
    "materials": "AbsValInequal",
    "title": "Absolute Value Equations and Inequalities",
    "resource": 141,
    "answers": ["D", "A", "C", "B", "C"]
  },
  {
    "description": "Compare the graph of a linear function, the graph of an absolute-value function, and the graphs of their translations. Vary the coefficients and constants in the functions and investigate how the graphs change in response.",
    "materials": "AbsValueLinFunc",
    "title": "Absolute Value with Linear Functions",
    "resource": 94,
    "answers": ["D", "B", "B", "D", "B"]
  },
  {
    "materials": "DirectInverseVar",
    "title": "Direct and Inverse Variation",
    "description": "Adjust the constant of variation and explore how the graph of the direct or inverse variation function changes in response. Compare direct variation functions to inverse variation functions.",
    "resource": 129,
    "answers": ["A", "C", "C", "C", "B"]
  },
  {
    "materials": "DivPoly",
    "title": "Dividing Polynomials Using Synthetic Division",
    "description": "Divide a polynomial by dragging the correct numbers into the correct positions for synthetic division. Compare the interpreted polynomial division to the synthetic division.",
    "resource": 131,
    "answers": ["B", "C", "D", "B", "C"]
  },
  {
    "materials": "GenFormRatlFunc",
    "title": "General Form of a Rational Function",
    "description": "Compare the equation of a rational function to its graph. Multiply or divide the numerator and denominator by linear factors and explore how the graph changes in response.",
    "resource": 137,
    "answers": ["B", "B", "D", "D", "C"]
  },
  {
    "materials": "AddPolynomials",
    "title": "Addition of Polynomials",
    "description": "Add polynomials using an area model. Use step-by-step feedback to diagnose any mistakes.",
    "resource": 97,
    "answers": ["D", "C", "B", "D", "B"]
  },
  {
    "title": "Factoring Special Products",
    "materials": "FacSpecProd",
    "description": "Choose the correct steps to factor a polynomial involving perfect-square binomials, differences of squares, or constant factors. Use the feedback to diagnose incorrect steps.",
    "resource": 106,
    "answers": ["C", "B", "D", "D", "A"]
  },
  {
    "title": "Polynomials and Linear Factors",
    "materials": "PolyLinearFactors",
    "description": "Create a polynomial as a product of linear factors. Vary the values in the linear factors to see how their connection to the roots of the function.",
    "resource": 148,
    "answers": ["C", "D", "D", "C", "A"]
  },
  {
    "materials": "IntroExponentialFctns",
    "title": "Introduction to Exponential Functions",
    "description": "Explore the graph of the exponential function. Vary the initial amount and base of the function. Investigate the changes to the graph.",
    "resource": 135,
    "answers": ["C", "D", "B", "D", "A"]
  },
  {
    "title": "Modeling the Factorization of x2+bx+c",
    "materials": "Factor_x2bxc",
    "description": "Factor a polynomial with a leading coefficient equal to 1 using an area model. Use step-by-step feedback to diagnose any mistakes.",
    "resource": 111,
    "answers": ["B", "A", "B", "D", "C"]
  },
  {
    "description": "Explore the graphs of two polynomials and the graph of their sum or difference. Vary the coefficients in the polynomials and investigate how the graphs change in response.",
    "materials": "AddSubtractFunctions",
    "title": "Addition and Subtraction of Functions",
    "resource": 96,
    "answers": ["D", "B", "C", "B", "A"]
  },
  {
    "title": "Modeling the Factorization of ax2+bx+c",
    "materials": "Factor_ax2bxc",
    "description": "Factor a polynomial with a leading coefficient greater than 1 using an area model. Use step-by-step feedback to diagnose any mistakes.",
    "resource": 110,
    "answers": ["C", "B", "B", "A", "D"]
  },
  {
    "materials": "ExponentialFctns",
    "title": "Exponential Functions",
    "description": "Explore the graph of an exponential function. Vary the coefficient and base of the function and investigate the changes to the graph of the function.",
    "resource": 134,
    "answers": ["D", "C", "B", "C", "D"]
  },
  {
    "description": "Study the graphs of polynomials up to the fourth degree. Vary the coefficients of the equation and investigate how the graph changes in response. Explore things like intercepts, end behavior, and even near-zero behavior.",
    "materials": "GraphsPolynomialFuncs",
    "title": "Graphs of Polynomial Functions",
    "resource": 136,
    "answers": ["B", "C", "D", "C", "D"]
  },
  {
    "materials": "Parabolas",
    "title": "Parabolas",
    "description": "Explore parabolas in a conic section context. Find the relationship among the vertex, focus, and directrix of a parabola, and how that relates to its equation.",
    "resource": 146,
    "answers": ["A", "B", "A", "B", "D"]
  },
  {
    "materials": "Hyperbolas",
    "title": "Hyperbolas",
    "description": "Compare the equation of a hyperbola to its graph. Vary the terms of the equation of the hyperbola. Examine how the graph of the hyperbola and its asymptotes changes in response.",
    "resource": 140,
    "answers": ["C", "D", "C", "A", "B"]
  },
  {
    "materials": "Ellipses",
    "title": "Ellipses",
    "description": "Compare the equation of an ellipse to its graph. Vary the terms of the equation of the ellipse and examine how the graph changes in response. Drag the vertices and foci, explore their Pythagorean relationship, and discover the string property.",
    "resource": 132,
    "answers": ["A", "A", "C", "A", "A"]
  },
  {
    "description": "Vary the coefficients in the equation of a function and examine how the graph of the function is translated or scaled. Select different functions to translate and scale, and determine what they have in common.",
    "materials": "TransScalFunc",
    "title": "Translating and Scaling Functions",
    "resource": 167,
    "answers": ["A", "D", "B", "A", "C"]
  },
  {
    "description": "Find the value of individual terms in an arithmetic or geometric sequence using graphs of the sequence and direct computation. Vary the common difference and common ratio and examine how the sequence changes in response.",
    "title": "Arithmetic and Geometric Sequences",
    "materials": "ArithGeoSequence",
    "resource": 340,
    "answers": ["C", "A", "D", "B", "D"]
  },
  {
    "description": "Find the value of individual terms in arithmetic sequences using graphs of the sequences and direct computation. Vary the common difference and examine how the sequences change in response.",
    "materials": "ArithSeq",
    "title": "Arithmetic Sequences",
    "resource": 125,
    "answers": ["D", "C", "B", "C", "A"]
  },
  {
    "description": "Vary the values in the equation of a logarithmic function and examine how the graph is translated or scaled. Connect these transformations with the domain of the function, and the asymptote in the graph.",
    "materials": "LogTranslateScale",
    "title": "Logarithmic Functions: Translating and Scaling",
    "resource": 504,
    "answers": ["C", "A", "D", "C", "A"]
  },
  {
    "title": "Cosine Function",
    "materials": "CosFunction",
    "description": "Compare the graph of the cosine function with the graph of the angle on the unit circle. Drag a point along the cosine curve and see the corresponding angle on the unit circle.",
    "resource": 128,
    "answers": ["A", "B", "B", "C", "C"]
  },
  {
    "materials": "TransScaleSinCos",
    "title": "Translating and Scaling Sine and Cosine Functions",
    "description": "Experiment with the graph of a sine or cosine function. Explore how changing the values in the equation can translate or scale the graph of the function.",
    "resource": 168,
    "answers": ["C", "A", "D", "B", "C"]
  },
  {
    "title": "Tangent Function",
    "materials": "TanFunction",
    "description": "Compare the graph of the tangent function with the graph of the angle on the unit circle. Drag a point along the tangent curve and see the corresponding angle on the unit circle.",
    "resource": 163,
    "answers": ["C", "A", "C", "C", "A"]
  },
  {
    "materials": "SumDiffId",
    "title": "Sum and Difference Identities for Sine and Cosine",
    "description": "Choose the correct steps to evaluate a trigonometric expression using sum and difference identities. Use step-by-step feedback to diagnose incorrect steps.",
    "resource": 160,
    "answers": ["A", "B", "C", "D", "A"]
  },
  {
    "materials": "SinFunction",
    "title": "Sine Function",
    "description": "Compare the graph of the sine function with the graph of the angle on the unit circle. Drag a point along the sine curve and see the corresponding angle on the unit circle.",
    "resource": 157,
    "answers": ["C", "B", "B", "D", "B"]
  },
  {
    "materials": "GeoSeq",
    "title": "Geometric Sequences",
    "description": "Explore geometric sequences by varying the initial term and the common ratio and examining the graph. Compute specific terms in the sequence using the explicit and recursive formulas.",
    "resource": 139,
    "answers": ["A", "C", "B", "C", "D"]
  },
  {
    "materials": "ConstructParaPerpLines",
    "title": "Constructing Parallel and Perpendicular Lines",
    "description": "Construct parallel and perpendicular lines using a straightedge and compass. Use step-by-step explanations and feedback to develop understanding of the construction.",
    "resource": 180,
    "answers": ["B", "D", "C", "A", "B"]
  },
  {
    "materials": "SimpRad",
    "title": "Simplifying Radical Expressions",
    "description": "Simplify a radical expression. Use step-by-step feedback to diagnose any incorrect steps.",
    "resource": 117,
    "answers": ["B", "B", "D", "D", "C"]
  },
  {
    "materials": "SimpTrigExp",
    "title": "Simplifying Trigonometric Expressions",
    "description": "Choose the correct steps to simplify a trigonometric function. Use step-by-step feedback to diagnose incorrect steps.",
    "resource": 155,
    "answers": ["D", "A", "D", "C", "A"]
  },
  {
    "materials": "ClassifyQuad",
    "title": "Classifying Quadrilaterals",
    "description": "Apply constraints to a quadrilateral, and then reshape and resize it. Classify the figure by its constraints. Explore the differences between the different kinds of quadrilaterals.",
    "resource": 176,
    "answers": ["D", "B", "A", "C", "C"]
  },
  {
    "title": "Constructing Congruent Segments and Angles",
    "materials": "ConstructCongSegAng",
    "description": "Construct congruent segments and angles using a straightedge and compass. Use step-by-step explanations and feedback to develop understanding of the construction.",
    "resource": 181,
    "answers": ["C", "B", "B", "B", "B"]
  },
  {
    "description": "Explore the relationships between perpendicular bisectors, the circumscribed circle, angle bisectors, the inscribed circle, altitudes, and medians using a triangle that can be resized and reshaped.",
    "materials": "ConcurrentLinesMedAlt",
    "title": "Concurrent Lines, Medians, and Altitudes",
    "resource": 177,
    "answers": ["A", "D", "A", "B", "D"]
  },
  {
    "materials": "ParallelogramCond",
    "title": "Parallelogram Conditions",
    "description": "Apply constraints to a dynamic quadrilateral. Then drag its vertices around. Determine which constraints guarantee that the quadrilateral is always a parallelogram.",
    "resource": 187,
    "answers": ["A", "C", "A", "D", "A"]
  },
  {
    "materials": "InvestigatingAngleThms",
    "title": "Investigating Angle Theorems",
    "description": "Explore the properties of complementary, supplementary, vertical, and adjacent angles using a dynamic figure.",
    "resource": 185,
    "answers": ["A", "C", "B", "B", "A"]
  },
  {
    "description": "Make a conditional statement from a given fact using word tiles. Use both symbolic form and standard English form.",
    "materials": "CondState",
    "title": "Conditional Statements",
    "resource": 178,
    "answers": ["A", "C", "D", "C", "D"]
  },
  {
    "description": "Place constraints on a triangle and determine what classifications must apply to the triangle.",
    "materials": "ClassifyTri",
    "title": "Classifying Triangles",
    "resource": 341,
    "answers": ["C", "A", "B", "C", "D"]
  },
  {
    "materials": "TriAngSum",
    "title": "Triangle Angle Sum",
    "description": "Measure the interior angles of a triangle and find the sum. Examine whether that sum is the same for all triangles. Also, discover how the measure of an exterior angle relates to the interior angle measures.",
    "resource": 202,
    "answers": ["C", "A", "A", "C", "D"]
  },
  {
    "title": "Congruence in Right Triangles",
    "materials": "CongRtTri",
    "description": "Apply constraints to two right triangles. Then drag their vertices around under those conditions. Determine under what conditions the triangles are guaranteed to be congruent.",
    "resource": 179,
    "answers": ["B", "C", "B", "D", "D"]
  },
  {
    "materials": "IsoscEquilatTriangles",
    "title": "Isosceles and Equilateral Triangles",
    "description": "Investigate the graph of a triangle under constraints. Determine which constraints guarantee isosceles or equilateral triangles.",
    "resource": 186,
    "answers": ["C", "A", "D", "B", "B"]
  },
  {
    "materials": "SegmentAngleBisector",
    "title": "Segment and Angle Bisectors",
    "description": "Explore the special properties of a point that lies on the perpendicular bisector of a segment, and of a point that lies on an angle bisector. Manipulate the point, the segment, and the angle to see that these properties are always true.",
    "resource": 174,
    "answers": ["B", "C", "C", "A", "D"]
  },
  {
    "materials": "ProvTriCongruent",
    "title": "Proving Triangles Congruent",
    "description": "Apply constraints to two triangles. Then drag the vertices of the triangles around and determine which constraints guarantee congruence.",
    "resource": 192,
    "answers": ["A", "C", "D", "C", "D"]
  },
  {
    "materials": "RotReflecTrans",
    "title": "Rotations, Reflections, and Translations",
    "description": "Rotate, reflect, and translate a figure in the plane. Compare the translated figure to the original figure.",
    "resource": 269,
    "answers": ["B", "D", "A", "C", "A"]
  },
  {
    "materials": "SpecialPara",
    "title": "Special Parallelograms",
    "description": "Apply constraints to a parallelogram and experiment with the resulting figure. What type of shape can you be sure that you have under each condition?",
    "resource": 198,
    "answers": ["B", "B", "B", "A", "B"]
  },
  {
    "materials": "TriangleIneq",
    "title": "Triangle Inequalities",
    "description": "Discover the inequalities related to the side lengths and angle measures of a triangle. Reshape and resize the triangle to confirm that these properties are true for all triangles.",
    "resource": 203,
    "answers": ["D", "C", "B", "D", "B"]
  },
  {
    "materials": "Translations",
    "title": "Translations",
    "description": "Translate a figure horizontally and vertically in the plane and examine the matrix representation of the translation.",
    "resource": 201,
    "answers": ["B", "B", "A", "A", "A"]
  },
  {
    "title": "Sine, Cosine, and Tangent Ratios",
    "materials": "SinCosTan",
    "description": "Reshape and resize a right triangle and examine how the sine of angle A, the cosine of angle A, and the tangent of angle A change.",
    "resource": 346,
    "answers": ["B", "D", "A", "D", "C"]
  },
  {
    "materials": "Dilations",
    "title": "Dilations",
    "description": "Dilate a figure and investigate its resized image. See how scaling a figure affects the coordinates of its vertices, both in (x, y) form and in matrix form.",
    "resource": 182,
    "answers": ["C", "B", "A", "B", "D"]
  },
  {
    "description": "Explore the distance formula as an application of the Pythagorean theorem. Learn to see any two points as the endpoints of the hypotenuse of a right triangle. Drag those points and examine changes to the triangle and the distance calculation.",
    "materials": "DistanceFormula",
    "title": "Distance Formula",
    "resource": 183,
    "answers": ["A", "A", "B", "D", "C"]
  },
  {
    "description": "Move, rotate, and resize two vectors in a plane. Find their resultant, both graphically and by direct computation.",
    "materials": "AddVectors",
    "title": "Adding Vectors",
    "resource": 171,
    "answers": ["C", "A", "D", "B", "A"]
  },
  {
    "description": "Compare the graph of a circle with its equation. Vary the terms in the equation and explore how the circle is translated and scaled in response.",
    "materials": "Circles",
    "title": "Circles",
    "resource": 127,
    "answers": ["D", "C", "B", "A", "D"]
  },
  {
    "title": "Parallel, Intersecting, and Skew Lines",
    "materials": "ParaIntersectSkew",
    "description": "Explore the properties of intersecting, parallel, and skew lines as well as lines in the plane. Rotate the plane and lines in three-dimensional space to ensure a full understanding of these objects.",
    "resource": 224,
    "answers": ["C", "B", "A", "D", "C"]
  },
  {
    "materials": "Radians",
    "title": "Radians",
    "description": "As factory belt operator, your job is to move boxes just the right distance on the belt, so they can be stamped for delivery. Your only controls are the radius and rotation of the belt’s wheel. How do you set these to get the distance right? See how this relates to arc length, and discover how radians help make this task easier.",
    "resource": 1202,
    "answers": ["B", "D", "C", "C", "A"]
  },
  {
    "materials": "PythThmGeoboard",
    "title": "Pythagorean Theorem with a Geoboard",
    "description": "Build right triangles in an interactive geoboard and build squares on the sides of the triangles to discover the Pythagorean Theorem.",
    "resource": 221,
    "answers": ["C", "C", "B", "B", "B"]
  },
  {
    "title": "Polygon Angle Sum",
    "materials": "PolyAngSum",
    "description": "Derive the sum of the angles of a polygon by dividing the polygon into triangles and summing their angles. Vary the number of sides and determine how the sum of the angles changes. Dilate the polygon to see that the sum is unchanged.",
    "resource": 190,
    "answers": ["C", "C", "A", "B", "A"]
  },
  {
    "description": "Reshape and resize a figure and examine how its reflection changes in response. Move the line of reflection and explore how the reflection is translated.",
    "materials": "Reflections",
    "title": "Reflections",
    "resource": 194,
    "answers": ["D", "B", "C", "C", "D"]
  },
  {
    "description": "Make a biconditional statement from a given definition using word tiles. Use both symbolic form and standard English form.",
    "materials": "BicondState",
    "title": "Biconditional Statements",
    "resource": 173,
    "answers": ["A", "C", "D", "A", "D"]
  },
  {
    "materials": "PythagThm",
    "title": "Pythagorean Theorem",
    "description": "Explore the Pythagorean Theorem using a dynamic right triangle. Examine a visual, geometric application of the Pythagorean Theorem, using the areas of squares on the sides of the triangle.",
    "resource": 200,
    "answers": ["D", "A", "A", "B", "A"]
  },
  {
    "description": "Resize angles inscribed in a circle. Investigate the relationship between inscribed angles and the arcs they intercept.",
    "materials": "InscribedAngles",
    "title": "Inscribed Angles",
    "resource": 184,
    "answers": ["A", "C", "C", "B", "B"]
  },
  {
    "description": "Arrange blocks in a three-dimensional space so that the top view, front view, and side view match the target top view, front view, and side view.",
    "resource": 170,
    "materials": "3DOrthographicViews",
    "title": "3D and Orthographic Views",
    "answers": ["C", "C", "D", "D", "D"]
  },
  {
    "description": "Vary the dimensions of a prism or cylinder and investigate how the surface area changes. Use the dynamic net of the solid to compute the lateral area and the surface area of the solid.",
    "materials": "SurfLatAreaPrismCyl",
    "title": "Surface and Lateral Areas of Prisms and Cylinders",
    "resource": 349,
    "answers": ["C", "D", "D", "B", "D"]
  },
  {
    "description": "Vary the height and base-edge or radius length of a prism or cylinder and examine how its three-dimensional representation changes. Determine the area of the base and the volume of the solid. Compare the volume of an oblique prism or cylinder to the volume of a right prism or cylinder.",
    "title": "Prisms and Cylinders",
    "materials": "PrismCylinder",
    "resource": 303,
    "answers": ["C", "D", "C", "D", "C"]
  },
  {
    "description": "Vary the dimensions of a pyramid or cone and investigate how the surface area changes. Use the dynamic net of the solid to compute the lateral area and the surface area of the solid.",
    "materials": "SurfLatAreaPyrCones",
    "title": "Surface and Lateral Areas of Pyramids and Cones",
    "resource": 350,
    "answers": ["C", "B", "C", "B", "B"]
  },
  {
    "description": "Examine and manipulate a parallelogram and find its area. Explore the relationship between the area of a parallelogram and the area of a rectangle using an animation.",
    "materials": "AreaPara",
    "title": "Area of Parallelograms",
    "resource": 245,
    "answers": ["C", "D", "B", "C", "C"]
  },
  {
    "description": "Resize a circle and compare its radius, circumference, and area.",
    "title": "Circumference and Area of Circles",
    "materials": "CircumAreaCircle",
    "resource": 206,
    "answers": ["D", "B", "C", "C", "B"]
  },
  {
    "title": "Perimeter and Area of Rectangles",
    "materials": "PerimAreaRectangles",
    "description": "Discover how to find the perimeter and area of a rectangle, and of a square (which is really just a special case of a rectangle).",
    "resource": 235,
    "answers": ["B", "C", "C", "C", "A"]
  },
  {
    "description": "Use a dynamic triangle to explore the area of a triangle. With the help of an animation, see that any triangle is always half of a parallelogram (with the same base and height). Likewise, a similar animation shows the connection between parallelograms and rectangles.",
    "materials": "AreaTri",
    "title": "Area of Triangles",
    "resource": 172,
    "answers": ["C", "D", "A", "A", "C"]
  },
  {
    "description": "Vary the scale factor and rotation of an image and compare it to the preimage. Determine how the angle measures and side lengths of the two figures are related.",
    "title": "Similar Figures",
    "materials": "SimFig",
    "resource": 271,
    "answers": ["D", "A", "B", "B", "D"]
  },
  {
    "materials": "SimRtTri",
    "title": "Similarity in Right Triangles",
    "description": "Divide a right triangle at the altitude to the hypotenuse to get two similar right triangles. Explore the relationship between the two triangles.",
    "resource": 196,
    "answers": ["A", "A", "B", "B", "C"]
  },
  {
    "title": "Perimeters and Areas of Similar Figures",
    "materials": "PerimAreaSimFig",
    "description": "Manipulate two similar figures and vary the scale factor to see what changes are possible under similarity. Explore how the perimeters and areas of two similar figures compare.",
    "resource": 189,
    "answers": ["B", "D", "A", "C", "C"]
  },
  {
    "materials": "StemLeafPlots",
    "title": "Stem-and-Leaf Plots",
    "description": "Build a data set and compare the line plot of the data set to the stem-and-leaf plot.",
    "resource": 236,
    "answers": ["D", "C", "D", "B", "A"]
  },
  {
    "materials": "RiemannSum",
    "title": "Riemann Sum",
    "description": "Approximate the area under a curve in an interval using rectangles. Compare the results of left-hand summation to the results of right-hand summation. Vary the interval and the number of rectangles and explore how the graph of the rectangles and curve change in response.",
    "resource": 153,
    "answers": ["A", "C", "A", "C", "B"]
  },
  {
    "description": "Explore the relationship between a central angle and the arcs it intercepts. Also explore the relationship between chords and their distance from the circle's center.",
    "title": "Chords and Arcs",
    "materials": "ChordArc",
    "resource": 175,
    "answers": ["C", "B", "A", "B", "B"]
  },
  {
    "description": "Investigate the mean, median, mode, and range of a data set through its graph. Manipulate the data and watch how the mean, median, mode, and range change (or, in some cases, how they don't change).",
    "materials": "DescribingDataStats",
    "title": "Describing Data Using Statistics",
    "resource": 100,
    "answers": ["B", "D", "D", "A", "A"]
  },
  {
    "materials": "PollingNeighborhood",
    "title": "Polling: Neighborhood",
    "description": "Conduct a phone poll of citizens in a small neighborhood to determine their response to a yes-or-no question. Use the results to estimate the sentiment of the entire population. Investigate how the error of this estimate becomes smaller as more people are polled. Compare random versus non-random sampling.",
    "resource": 507,
    "answers": ["D", "C", "A", "C", "C"]
  },
  {
    "description": "Construct a box-and-whisker plot to match a line plots, and construct a line plot to match a box-and-whisker plots. Manipulate the line plot and examine how the box-and-whisker plot changes. Then manipulate the box-and-whisker plot and examine how the line plot changes.",
    "materials": "BoxWhiskerPlots",
    "title": "Box-and-Whisker Plots",
    "resource": 169,
    "answers": ["A", "B", "C", "C", "D"]
  },
  {
    "materials": "MeanMedianMode",
    "title": "Mean, Median, and Mode",
    "description": "Build a data set and find the mean, median, and mode. Explore the mean, median, and mode illustrated as frogs on a seesaw, frogs on a scale, and as frogs stacked under a bar of variable height.",
    "resource": 262,
    "answers": ["B", "B", "C", "D", "C"]
  },
  {
    "materials": "PollingCity",
    "title": "Polling: City",
    "description": "Poll residents in a large city to determine their response to a yes-or-no question. Estimate the actual percentage of yes votes in the whole city. Examine the results of many polls to help assess how reliable the results from a single poll are. See how the normal curve approximates a binomial distribution for large enough polls.",
    "resource": 505,
    "answers": ["B", "C", "C", "B", "A"]
  },
  {
    "materials": "LeastSquares",
    "title": "Least-Squares Best Fit Lines",
    "description": "Fit a line to the data in a scatter plot using your own judgment. Then compare the least squares line of best fit.",
    "resource": 144,
    "answers": ["C", "C", "A", "C", "A"]
  },
  {
    "materials": "PopulationsSamples",
    "title": "Populations and Samples",
    "description": "Compare sample distributions drawn from population distributions. Predict characteristics of a population distribution based on a sample distribution and examine how well a small sample represents a given population.",
    "resource": 508,
    "answers": ["D", "D", "C", "B", "C"]
  },
  {
    "title": "Trends in Scatter Plots",
    "materials": "ScatterPlots",
    "description": "Examine the scatter plot for a random data set with negative or positive correlation. Vary the correlation and explore how correlation is reflected in the scatter plot and the trend line.",
    "resource": 308,
    "answers": ["A", "B", "D", "B", "C"]
  },
  {
    "materials": "Histograms",
    "title": "Histograms",
    "description": "Change the values in a data set and examine how the dynamic histogram changes in response. Adjust the interval size of the histogram and see how the shape of the histogram is affected.",
    "resource": 222,
    "answers": ["C", "B", "D", "C", "A"]
  },
  {
    "description": "Explore the relationship between the correlation coefficient of a data set and its graph. Fit a line to the data and compare the least-squares fit line.",
    "materials": "Correlation",
    "title": "Correlation",
    "resource": 101,
    "answers": ["C", "C", "C", "A", "C"]
  },
  {
    "description": "Find the probability of a number of successes or failures in a binomial experiment using a tree diagram, a bar graph, and direct calculation.",
    "materials": "BinomialProbabilities",
    "title": "Binomial Probabilities",
    "resource": 126,
    "answers": ["D", "B", "C", "C", "B"]
  },
  {
    "description": "Randomly throw darts at a target and see what percent are \"hits.\" Vary the size of the target and repeat the experiment. Study the relationship between the area of the target and the percent of darts that strike it",
    "materials": "GeometricProbability",
    "title": "Geometric Probability",
    "resource": 138,
    "answers": ["B", "D", "D", "B", "C"]
  },
  {
    "title": "Properties of Matter STEM Case",
    "resource": 3120,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "title": "Independent and Dependent Events",
    "materials": "IndepDepEvents",
    "description": "Compare the theoretical and experimental probabilities of drawing colored marbles from a bag. Record results of successive draws to find the experimental probability. Perform the drawings with replacement of the marbles to study independent events, or without replacement to explore dependent events.",
    "resource": 249,
    "answers": ["A", "D", "B", "B", "C"]
  },
  {
    "materials": "SolvTrendLines",
    "title": "Solving Using Trend Lines",
    "description": "Examine the scatter plots for data related to weather at different latitudes. The Gizmo includes three different data sets, one with negative correlation, one positive, and one with no correlation. Compare the least squares best-fit line.",
    "resource": 348,
    "answers": ["C", "C", "A", "A", "B"]
  },
  {
    "materials": "Pulleys",
    "title": "Pulleys",
    "description": "Lift a variety of heavy objects (armchair, safe, piano) using pulleys and a rope. Systems of one, two, four, or six pulleys can be used. Up to six people can be used to pull on the rope, which adds force (effort).",
    "resource": 643,
    "answers": ["D", "A", "B", "C", "A"]
  },
  {
    "materials": "Homeostasis",
    "title": "Homeostasis",
    "description": "Control a simulated person running on a treadmill. Your challenge is to use clothing, exercise, and sweat to maintain a constant body temperature as air temperature goes up and down. Sweating (perspiration) can be controlled automatically by the Gizmo or, for a challenge, manually by the user. Don't forget to eat and drink!",
    "resource": 659,
    "answers": ["D", "A", "D", "C", "B"]
  },
  {
    "description": "Observe solar and lunar eclipses as the Moon orbits Earth. The full and partial shadows of the Moon and Earth can be displayed, and the Moon can also be dragged around Earth. See what the Moon and Sun look like from Earth during partial and total eclipses.",
    "materials": "Eclipse",
    "title": "Eclipse",
    "resource": 644,
    "answers": ["A", "A", "C", "A", "D"]
  },
  {
    "description": "Pick a duck, win a prize! Help Arnie the carnie design his game so that he makes money (or at least breaks even). How many ducks of each type should there be? What are the prizes worth? How much should he charge to play? Lucky Duck is a fun way to learn about probabilities and expected value.",
    "materials": "LuckyDuck",
    "title": "Lucky Duck (Expected Value)",
    "resource": 1201,
    "answers": ["D", "B", "C", "D", "D"]
  },
  {
    "materials": "OceanTides",
    "title": "Ocean Tides",
    "description": "Develop an understanding of ocean tides by comparing the depth of water near a dock to the positions of the Moon, Sun, and Earth. Determine the influence of the Moon and Sun on tides, and compare spring tides to neap tides.",
    "resource": 634,
    "answers": ["C", "A", "B", "B", "D"]
  },
  {
    "materials": "SummerWinter",
    "title": "Summer and Winter",
    "description": "Observe the tilt of Earth's axis and the angle that sunlight strikes Earth on June 21 and December 21. Compare day lengths, temperatures, and the angle of the Sun's rays for any latitude. The tilt of the Earth's axis can be varied to see how this would affect seasons.",
    "resource": 656,
    "answers": ["D", "B", "C", "D", "C"]
  },
  {
    "materials": "ForceFanCarts",
    "title": "Force and Fan Carts",
    "description": "Explore the laws of motion using a simple fan cart. Use the buttons to select the speed of the fan and the surface, and press Play to begin. You can drag up to three objects onto the fan cart. The speed of the cart is displayed with a speedometer and recorded in a table and a graph.",
    "resource": 614,
    "answers": []
  },
  {
    "materials": "ProbabilitySimulations",
    "title": "Probability Simulations",
    "description": "Experiment with spinners and compare the experimental probability of particular outcomes to the theoretical probability. Select the number of spinners, the number of sections on a spinner, and a favorable outcome of a spin. Then tally the number of favorable outcomes.",
    "resource": 233,
    "answers": ["B", "B", "D", "A", "C"]
  },
  {
    "description": "Observe the steps of pollination and fertilization in flowering plants. Help with many parts of the process by dragging pollen grains to the stigma, dragging sperm to the ovules, and removing petals as the fruit begins to grow. Quiz yourself when you are done by dragging vocabulary words to the correct plant structure.",
    "materials": "FlowerPollination",
    "title": "Flower Pollination",
    "resource": 635,
    "answers": ["D", "C", "B", "B", "D"]
  },
  {
    "description": "Measure the mass and volume of a variety of objects, then place them into a beaker of liquid to see if they float or sink. Learn to predict whether objects will float or sink in water based on their mass and volume. Compare how objects float or sink in a variety of liquids, including gasoline, oil, seawater, and corn syrup.",
    "materials": "Density",
    "title": "Density",
    "resource": 629,
    "answers": ["A", "B", "C", "C", "B"]
  },
  {
    "description": "Recreate Galileo's famous experiment by dropping objects off the Tower of Pisa. You can drop ping pong balls, golf balls, soccer balls or watermelons. Objects can be dropped in air or no air, with or without a parachute. The speed of each object is shown on a speedometer and a graph.",
    "materials": "FreeFallTower",
    "title": "Free Fall Tower",
    "resource": 650,
    "answers": ["A", "C", "D", "B", "B"]
  },
  {
    "materials": "PhasesWater",
    "title": "Phases of Water",
    "description": "Heat or cool a container of water and observe the phase changes that take place. Use a magnifying glass to observe water molecules as a solid, liquid, or gas. Compare the volumes of the three phases of water.",
    "resource": 661,
    "answers": ["B", "C", "C", "D", "B"]
  },
  {
    "description": "Lift food using ants with the help of a slanted stick. The steepness of the stick, the number of ants, and the size of the item being lifted can be varied. Observe the effect of friction on sliding objects.",
    "materials": "AntSlant",
    "title": "Ants on a Slant (Inclined Plane)",
    "resource": 649,
    "answers": ["C", "D", "A", "D", "C"]
  },
  {
    "materials": "PermutationsCombinations",
    "title": "Permutations and Combinations",
    "description": "Experiment with permutations and combinations of a number of letters represented by letter tiles selected at random from a box. Count the permutations and combinations using a dynamic tree diagram, a dynamic list of permutations, and a dynamic computation by the counting principle.",
    "resource": 307,
    "answers": ["A", "A", "A", "C", "A"]
  },
  {
    "description": "Create circuits using batteries, light bulbs, switches, fuses, and a variety of materials. Examine series and parallel circuits, conductors and insulators, and the effects of battery voltage. Thousands of different circuits can be built with this Gizmo.",
    "materials": "CircuitBuilder",
    "title": "Circuit Builder",
    "resource": 638,
    "answers": ["C", "A", "C", "B", "B"]
  },
  {
    "description": "Control the intensity of red, green, and blue spotlights. Additive colors can be observed where the spotlights overlap. The RGB value of any point can be measured. Just about any color can be created by mixing varying amounts of red, green, and blue light.",
    "materials": "AdditiveColors",
    "title": "Additive Colors",
    "resource": 412,
    "answers": ["B", "C", "D", "A", "A"]
  },
  {
    "description": "Vary the height and base-edge or radius length of a pyramid or cone and examine how its three-dimensional representation changes. Determine the area of the base and the volume of the solid. Compare the volume of a skew pyramid or cone to the volume of a right pyramid or cone.",
    "title": "Pyramids and Cones",
    "materials": "PyramidCone",
    "resource": 193,
    "answers": ["C", "C", "C", "A", "A"]
  },
  {
    "materials": "SubtractiveColors",
    "title": "Subtractive Colors",
    "description": "Move spots of yellow, cyan, and magenta pigment on a white surface. As the colors overlap, other colors can be seen due to color subtraction. The color of most things you see--such as cars, leaves, paintings, houses, and clothes--are due to color subtraction. The intensity of the cyan, magenta, and yellow can be adjusted, and the RGB value at any location can be measured.",
    "resource": 413,
    "answers": ["A", "C", "B", "C", "D"]
  },
  {
    "description": "Study the production and use of gases by plants and animals. Measure the oxygen and carbon dioxide levels in a test tube containing snails and elodea (a type of plant) in both light and dark conditions. Learn about the interdependence of plants and animals.",
    "materials": "PlantsSnails",
    "title": "Plants and Snails",
    "resource": 641,
    "answers": ["B", "B", "C", "B", "C"]
  },
  {
    "description": "Plant seeds and watch how many sprout. Examine what factors affect germination. Vary the amount of heat, water, and light the seeds get. Practice designing controlled experiments and using the scientific method.",
    "materials": "Germination",
    "title": "Germination",
    "resource": 637,
    "answers": ["C", "B", "A", "B", "B"]
  },
  {
    "title": "Heredity and Traits STEM Case",
    "resource": 3172,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "materials": "HoneybeeHive",
    "title": "Honeybee Hive",
    "description": "Explore life in the hive by meeting workers, drones, and the queen bee herself! Visit flower patches to determine the best sources of food, and then perform a waggle dance to let the other bees know where to go. Can you help the bees find enough food to save the hive?",
    "resource": 1079,
    "answers": ["D", "B", "A", "D", "B"]
  },
  {
    "materials": "ObservingWeather",
    "title": "Observing Weather (Metric)",
    "description": "How do scientists measure and describe the weather? In this introductory lesson, students will practice using a thermometer, anemometer, rain gauge, and hygrometer to record weather conditions in a variety of locations and dates. This lesson uses metric units.",
    "resource": 1067,
    "answers": ["C", "D", "C", "B", "A"]
  },
  {
    "materials": "ObservingWeatherC",
    "title": "Observing Weather (Customary)",
    "description": "How do scientists measure and describe the weather? In this introductory lesson, students will practice using a thermometer, anemometer, rain gauge, and hygrometer to record weather conditions in a variety of locations and dates. This lesson uses U.S. customary units.",
    "resource": 1058,
    "answers": ["D", "D", "B", "B", "A"]
  },
  {
    "materials": "ComparingClimates",
    "title": "Comparing Climates (Metric)",
    "description": "Compare average temperatures, precipitation, humidity, and wind speed for a variety of locations across the globe. Explore the influence of latitude, proximity to oceans, elevation, and other factors on climate. Observe how animals and plants are adapted to climate and their environment. This lesson uses metric units.",
    "resource": 1071,
    "answers": ["B", "A", "C", "D", "A"]
  },
  {
    "materials": "SolarSystem",
    "title": "Solar System",
    "description": "Explore our solar system and learn the characteristics of each planet. Compare the sizes of planets and their distances from the Sun. Observe the speeds of planetary orbits and measure how long each planet takes to go around the Sun.",
    "resource": 636,
    "answers": []
  },
  {
    "materials": "ComparingClimatesC",
    "title": "Comparing Climates (Customary)",
    "description": "Compare average temperatures, precipitation, humidity, and wind speed for a variety of locations across the globe. Explore the influence of latitude, proximity to oceans, elevation, and other factors on climate. Observe how animals and plants are adapted to climate and their environment. This lesson uses U.S. customary units.",
    "resource": 1080,
    "answers": ["B", "A", "C", "D", "A"]
  },
  {
    "materials": "Inheritance",
    "title": "Inheritance",
    "description": "Create aliens with different traits and breed them to produce offspring. Determine which traits are passed down from parents to offspring and which traits are acquired. Offspring can be stored for future experiments or released.",
    "resource": 657,
    "answers": ["D", "B", "D", "C", "A"]
  },
  {
    "title": "Fruit Production STEM Case",
    "resource": 3152,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "title": "Theoretical and Experimental Probability",
    "materials": "TheoExpProbability",
    "description": "Experiment with spinners and compare the experimental probability of a particular outcome to the theoretical probability. Select the number of spinners, the number of sections on a spinner, and a favorable outcome of a spin. Then tally the number of favorable outcomes.",
    "resource": 310,
    "answers": ["C", "B", "C", "C", "B"]
  },
  {
    "title": "Chemical and Physical Changes STEM Case",
    "resource": 3142,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "materials": "MeasuringMotion",
    "title": "Measuring Motion",
    "description": "Go on an African safari and observe a variety of animals walking and running across the savanna. Videotape the animals, and then play back the videotape to estimate animal speeds. Which animals run fastest?",
    "resource": 660,
    "answers": ["B", "C", "A", "C", "A"]
  },
  {
    "description": "Drop a chunk of material in a beaker of water and observe whether it sinks or floats. Cut the chunk into smaller pieces of any size, and observe what happens as they are dropped in the beaker. The mass and volume of each chunk can be measured to gain a clear understanding of density and buoyancy.",
    "materials": "DensitySlice",
    "title": "Density Experiment: Slice and Dice",
    "resource": 434,
    "answers": ["A", "A", "D", "D", "D"]
  },
  {
    "description": "Using four beakers of liquids with known densities, estimate the density of a variety of objects. Place each object into each beaker to see whether it sinks or floats, and then use this information to compare the densities of the objects.",
    "materials": "DensityComparison",
    "title": "Density via Comparison",
    "resource": 396,
    "answers": []
  },
  {
    "description": "With a scale to measure mass, a graduated cylinder to measure volume, and a large beaker of liquid to observe flotation, the relationship between mass, volume, density, and flotation can be investigated. The density of the liquid in the beaker can be adjusted, and a variety of objects can be studied during the investigation.",
    "materials": "DensityLab",
    "title": "Density Laboratory",
    "resource": 362,
    "answers": []
  },
  {
    "materials": "MeasuringTrees",
    "title": "Measuring Trees",
    "description": "Measure the height, diameter, and circumference of trees in a forest. Count growth rings to determine the age of each tree. Grow the trees for several years and investigate how growth is affected by precipitation.",
    "resource": 666,
    "answers": ["B", "C", "B", "C", "A"]
  },
  {
    "materials": "ProgrammableRover",
    "title": "Programmable Rover",
    "description": "In this introduction to coding, program a rover to explore the surface of Mars. Start by using tiles to create simple programs involving moving forward or backward, turns, jumps, loops, and picking up rock samples. Then use text instructions to optimize your code. Use your skills to program the rover to complete six challenging missions on Mars.",
    "resource": 1086,
    "answers": ["D", "B", "C", "B", "C"]
  },
  {
    "description": "Use protons, neutrons, and electrons to build elements. As the number of protons, neutrons, and electrons changes, information such as the name and symbol of the element, the Z, N, and A numbers, the electron dot diagram, and the group and period from the periodic table are shown. Each element is classified as a metal, metalloid, or nonmetal, and its state at room temperature is also given.",
    "materials": "ElementBuilder",
    "title": "Element Builder",
    "resource": 424,
    "answers": ["C", "C", "A", "A", "C"]
  },
  {
    "description": "Drop objects in a beaker that is filled with water, and measure the water that flows over the edge. Using Archimedes' principle, determine the density of objects based on the amount of displaced water.",
    "title": "Determining Density via Water Displacement",
    "materials": "DensityWater",
    "resource": 400,
    "answers": ["C", "A", "C", "A", "B"]
  },
  {
    "materials": "PeriodicTrends",
    "title": "Periodic Trends",
    "description": "Explore trends in atomic radius, ionization energy, and electron affinity in the periodic table. Measure atomic radius with a ruler and model ionization energy and electron affinity by exploring how easy it is to remove electrons and how strongly atoms attract additional electrons. View these properties on the whole periodic table to see how they vary across periods and down groups.",
    "resource": 1077,
    "answers": ["C", "B", "A", "A", "D"]
  },
  {
    "materials": "Isotopes",
    "title": "Isotopes",
    "description": "Explore what isotopes are by adding protons and neutrons to the nucleus of an atom. Plot both stable and radioactive isotopes on a graph of neutrons vs. protons, and explore how the neutron:proton ratio of stable isotopes changes from lighter to heavier elements.",
    "resource": 1081,
    "answers": ["A", "D", "C", "D", "B"]
  },
  {
    "description": "Investigate the decay of a radioactive substance. The half-life and the number of radioactive atoms can be adjusted, and theoretical or random decay can be observed. Data can be interpreted visually using a dynamic graph, a bar chart, and a table. Determine the half-lives of two sample isotopes as well as samples with randomly generated half-lives.",
    "materials": "Half-life",
    "title": "Half-life",
    "resource": 369,
    "answers": ["C", "B", "C", "B", "B"]
  },
  {
    "description": "Shoot a stream of photons through a container of hydrogen gas. Observe how photons of certain energies are absorbed, causing the electron to move to different orbits. Build the spectrum of hydrogen based on photons that are absorbed and emitted.",
    "materials": "BohrModelHydrogen",
    "title": "Bohr Model of Hydrogen",
    "resource": 506,
    "answers": ["B", "B", "C", "A", "D"]
  },
  {
    "materials": "ElectronConfiguration",
    "title": "Electron Configuration",
    "description": "Create the electron configuration of any element by filling electron orbitals. Determine the relationship between electron configuration and atomic radius. Discover trends in atomic radii across periods and down families/groups of the periodic table.",
    "resource": 513,
    "answers": ["C", "D", "A", "D", "B"]
  },
  {
    "description": "The atomic mass for each element listed in the periodic table is actually the weighted average mass of all of the different isotopes of the element. In the Average Atomic Mass Gizmo, use a mass spectrometer to separate an element into its isotopes. Then, calculate the average atomic mass by considering the mass and abundance of each isotope.",
    "materials": "AverageAtomicMass",
    "title": "Average Atomic Mass",
    "resource": 1088,
    "answers": ["B", "B", "B", "C", "D"]
  },
  {
    "description": "Fire photons to determine the spectrum of a gas. Observe how an absorbed photon changes the orbit of an electron and how a photon is emitted from an excited electron. Calculate the energies of absorbed and emitted photons based on energy level diagrams. The light energy produced by the laser can be modulated, and a lamp can be used to view the entire absorption spectrum at once.",
    "materials": "BohrModelIntro",
    "title": "Bohr Model: Introduction",
    "resource": 510,
    "answers": ["D", "C", "B", "D", "C"]
  },
  {
    "materials": "CovalentBonds",
    "title": "Covalent Bonds",
    "description": "Choose a substance, and then move electrons between atoms to form covalent bonds and build molecules. Observe the orbits of shared electrons in single, double, and triple covalent bonds. Compare the completed molecules to the corresponding Lewis diagrams.",
    "resource": 512,
    "answers": ["C", "D", "C", "B", "D"]
  },
  {
    "materials": "ChemicalChanges",
    "description": "Chemical changes result in the formation of new substances. But how can you tell if a chemical change has occurred? Explore this question by observing and measuring a variety of chemical reactions. Along the way you will learn about chemical equations, acids and bases, exothermic and endothermic reactions, and conservation of matter.",
    "title": "Chemical Changes",
    "resource": 1060,
    "answers": ["D", "B", "B", "C", "D"]
  },
  {
    "description": "Observe a chemical reaction with and without a catalyst. Determine the effects of concentration, temperature, surface area, and catalysts on reaction rates. Reactant and product concentrations through time are recorded, and the speed of the simulation can be adjusted by the user.",
    "materials": "CollisionTheory",
    "title": "Collision Theory",
    "resource": 553,
    "answers": ["A", "C", "B", "C", "B"]
  },
  {
    "materials": "LimitingReactants",
    "title": "Limiting Reactants",
    "description": "Explore the concepts of limiting reactants, excess reactants, and theoretical yield in a chemical reaction. Select one of two different reactions, choose the number of molecules of each reactant, and then observe the products created and the reactants left over.",
    "resource": 365,
    "answers": ["A", "A", "B", "C", "D"]
  },
  {
    "title": "Polarity and Intermolecular Forces",
    "materials": "IntermolecularForces",
    "description": "Combine various metal and nonmetal atoms to observe how the electronegativity difference determines the polarity of chemical bonds. Place molecules into an electric field to experimentally determine if they are polar or nonpolar. Create different mixtures of polar and nonpolar molecules to explore the intermolecular forces that arise between them.",
    "resource": 1091,
    "answers": ["B", "A", "B", "C", "D"]
  },
  {
    "description": "Simulate ionic bonds between a variety of metals and nonmetals. Select a metal and a nonmetal atom, and transfer electrons from one to the other. Observe the effect of gaining and losing electrons on charge, and rearrange the atoms to represent the molecular structure. Additional metal and nonmetal atoms can be added to the screen, and the resulting chemical formula can be displayed.",
    "materials": "IonicBonds",
    "title": "Ionic Bonds",
    "resource": 514,
    "answers": ["D", "A", "D", "B", "C"]
  },
  {
    "title": "Enzymes STEM Case",
    "resource": 3036,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "materials": "Stoichiometry",
    "title": "Stoichiometry",
    "description": "Solve problems in chemistry using dimensional analysis. Select appropriate tiles so that units in the question are converted into units of the answer. Tiles can be flipped, and answers can be calculated once the appropriate unit conversions have been applied.",
    "resource": 515,
    "answers": ["B", "C", "B", "A", "B"]
  },
  {
    "description": "Observe how reactants and products interact in reversible reactions. The amounts of each substance can be manipulated, as well as the pressure on the chamber. This lesson focuses on partial pressures, Dalton's law, and Le Chatelier's principle.",
    "materials": "EquilibriumPressure",
    "title": "Equilibrium and Pressure",
    "resource": 1049,
    "answers": ["B", "D", "B", "C", "A"]
  },
  {
    "description": "Practice balancing chemical equations by changing the coefficients of reactants and products. As the equation is manipulated, the amount of each element is shown as individual atoms, histograms, or numerically. Molar masses of reactants and products can also be calculated and balanced to demonstrate conservation of mass.",
    "title": "Chemical Equations",
    "materials": "ChemEquations",
    "resource": 461,
    "answers": ["C", "B", "D", "A", "D"]
  },
  {
    "materials": "BalancingChemEquations",
    "title": "Balancing Chemical Equations",
    "description": "Balance and classify five types of chemical reactions: synthesis, decomposition, single replacement, double replacement, and combustion. While balancing the reactions, the number of atoms on each side is presented as visual, histogram, and numerical data.",
    "resource": 408,
    "answers": ["D", "C", "B", "C", "B"]
  },
  {
    "materials": "Titration",
    "title": "Titration",
    "description": "Measure the quantity of a known solution needed to neutralize an acid or base of unknown concentration. Use this information to calculate the unknown concentration. A variety of indicators can be used to show the pH of the solution.",
    "resource": 1045,
    "answers": ["B", "A", "B", "C", "D"]
  },
  {
    "description": "Determine how the physical properties of a solvent are dependent on the number of solute particles present. Measure the vapor pressure, boiling point, freezing point, and osmotic pressure of pure water and a variety of solutions. Compare the effects of four solutes (sucrose, sodium chloride, calcium chloride, and potassium chloride) on these physical properties.",
    "materials": "ColligativeProperties",
    "title": "Colligative Properties",
    "resource": 511,
    "answers": ["A", "C", "D", "B", "D"]
  },
  {
    "materials": "StickyMolecules",
    "title": "Sticky Molecules",
    "description": "Learn about molecular polarity and how polarity gives rise to intermolecular forces. Measure four macroscopic properties of liquids (cohesion, adhesion, surface tension, and capillary rise). Compare these properties for different liquids and relate them to whether the substances are polar or nonpolar.",
    "resource": 1093,
    "answers": ["B", "D", "B", "A", "D"]
  },
  {
    "materials": "ReactionEnergy",
    "title": "Reaction Energy",
    "description": "Exothermic chemical reactions release energy, while endothermic reactions absorb energy. But what causes some reactions to be exothermic, and others to be endothermic? In this simulation, compare the energy absorbed in breaking bonds to the energy released in forming bonds to determine if a reaction will be exothermic or endothermic.",
    "resource": 1065,
    "answers": ["D", "B", "A", "D", "B"]
  },
  {
    "materials": "DehydrationSynthesis",
    "title": "Dehydration Synthesis",
    "description": "Build a glucose molecule, atom-by-atom, to learn about chemical bonds and the structure of glucose. Explore the processes of dehydration synthesis and hydrolysis in carbohydrate molecules.",
    "resource": 464,
    "answers": ["B", "D", "C", "C", "D"]
  },
  {
    "description": "Explore the processes of photosynthesis and respiration that occur within plant and animal cells. The cyclical nature of the two processes can be constructed visually, and the simplified photosynthesis and respiration formulae can be balanced.",
    "materials": "CellEnergy",
    "title": "Cell Energy Cycle",
    "resource": 455,
    "answers": ["C", "D", "B", "B", "C"]
  },
  {
    "materials": "VirusLyticCycle",
    "title": "Virus Lytic Cycle",
    "description": "Release a lytic virus in a group of cells and observe how cells are infected over time and eventually destroyed. Data related to the number of healthy cells, infected cells, and viruses can be recorded over time to determine the time required for the virus to mature within a cell.",
    "resource": 448,
    "answers": ["A", "A", "B", "C", "B"]
  },
  {
    "materials": "PollinationFlowerFruit",
    "title": "Pollination: Flower to Fruit",
    "description": "Label a diagram that illustrates the anatomy of a flower, and understand the function of each structure. Compare the processes of self pollination and cross pollination, and explore how fertilization takes place in a flowering plant.",
    "resource": 451,
    "answers": ["C", "C", "A", "D", "B"]
  },
  {
    "materials": "Osmosis",
    "title": "Osmosis",
    "description": "Adjust the concentration of a solute on either side of a membrane in a cell and observe the system as it adjusts to the conditions through osmosis. The initial concentration of the solute can be manipulated, along with the volume of the cell.",
    "resource": 418,
    "answers": ["A", "D", "D", "A", "B"]
  },
  {
    "description": "Trace the path of blood through a beating heart and the network of blood vessels that supplies blood to the body. Take blood samples from different blood vessels to observe blood cells and measure the levels of oxygen, carbon dioxide, sugar, and urea.",
    "materials": "CirculatorySystem",
    "title": "Circulatory System",
    "resource": 662,
    "answers": ["B", "B", "D", "A", "C"]
  },
  {
    "materials": "HumanHomeostasis",
    "title": "Human Homeostasis",
    "description": "Adjust the levels of clothing, perspiration, and exercise to maintain a stable internal temperature as the external temperature changes. Water and blood sugar levels need to be replenished regularly, and fatigue occurs with heavy exercise. Severe hypothermia, heat stroke, or dehydration can result if internal stability is not maintained.",
    "resource": 519,
    "answers": ["B", "A", "D", "B", "C"]
  },
  {
    "title": "Diffusion STEM Case",
    "resource": 3104,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "description": "Observe how reactants and products interact in reversible reactions. The initial amount of each substance can be manipulated, as well as the pressure on the chamber. The amounts, concentrations, and partial pressures of each reactant and product can be tracked over time as the reaction proceeds toward equilibrium.",
    "materials": "EquilibriumConcentration",
    "title": "Equilibrium and Concentration",
    "resource": 1046,
    "answers": ["C", "B", "A", "C", "C"]
  },
  {
    "description": "Explore the motion of particles as they bounce around from one side of a room to the other through an adjustable gap or partition. The mass of the particles can be adjusted, as well as the temperature of the room and the initial number of particles. In a real-world context, this can be used to learn about how odors travel, fluids move through gaps, the thermodynamics of gases, and statistical probability.",
    "materials": "Diffusion",
    "title": "Diffusion",
    "resource": 417,
    "answers": ["D", "C", "C", "B", "A"]
  },
  {
    "title": "Osmosis STEM Case",
    "resource": 3094,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "materials": "MeltingPoints",
    "title": "Melting Points",
    "description": "Every substance has unique transition points, or temperatures at which one phase (solid, liquid, or gas) transitions to another. Use a realistic melting point apparatus to measure the melting points, boiling points, and/or sublimation points of different substances and observe what these phase changes look like at the microscopic level. Based on the transition points, make inferences about the relative strengths of the forces holding these substances together.",
    "resource": 1063,
    "answers": ["A", "A", "C", "A", "D"]
  },
  {
    "title": "Homeostasis STEM Case",
    "resource": 3024,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "title": "Cell Respiration STEM Case",
    "resource": 3064,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "description": "Explore how a fertilized cell develops into an embryo, a fetus, and eventually an adult organism. Compare embryo development in different vertebrate species and try to guess which embryo belongs to each species. Use dyes to trace the differentiation of cells during early embryo development, from the zygote to the neurula.",
    "materials": "EmbryoDevelopment",
    "title": "Embryo Development",
    "resource": 1074,
    "answers": ["D", "C", "B", "C", "B"]
  },
  {
    "description": "Using the scientific method, control the environmental conditions for a fictional alien organism in order to learn how the organism responds to changes in conditions. Sunlight, water, and temperature can be varied to determine their effects on the shape of the aliens.",
    "materials": "EffectEnvironment",
    "title": "Effect of Environment on New Life Form",
    "resource": 397,
    "answers": ["D", "A", "C", "D", "D"]
  },
  {
    "materials": "RabbitPopulationSeason",
    "title": "Rabbit Population by Season",
    "description": "Observe the population of rabbits in an environment over many years. The land available to the rabbits and weather conditions can be adjusted to investigate the effects of urban sprawl and unusual weather on wildlife populations.",
    "resource": 380,
    "answers": ["A", "A", "D", "D", "B"]
  },
  {
    "title": "Ecosystems STEM Case",
    "resource": 3014,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "materials": "SolubilityTemperature",
    "title": "Solubility and Temperature",
    "description": "Add varying amounts of a chemical to a beaker of water to create a solution, observe that the chemical dissolves in the water at first, and then measure the concentration of the solution at the saturation point. Either potassium nitrate or sodium chloride can be added to the water, and the temperature of the water can be adjusted.",
    "resource": 384,
    "answers": ["D", "A", "C", "A", "C"]
  },
  {
    "materials": "ChickenGenetics",
    "title": "Chicken Genetics",
    "description": "Breed \"pure\" chickens with known genotypes that exhibit specific feather colors, and learn how traits are passed on via codominant genes. Chickens can be stored in cages for future breeding, and the statistics of feather color are reported every time the chickens breed. Punnett squares can be used to predict results.",
    "resource": 453,
    "answers": ["B", "C", "A", "C", "D"]
  },
  {
    "description": "Construct a DNA molecule, examine its double-helix structure, and then go through the DNA replication process. Learn how each component fits into a DNA molecule, and see how a unique, self-replicating code can be created.",
    "materials": "BuildingDNA",
    "title": "Building DNA",
    "resource": 439,
    "answers": ["B", "D", "B", "A", "C"]
  },
  {
    "description": "In this ecosystem consisting of hawks, snakes, rabbits and grass, the population of each species can be studied as part of a food chain. Disease can be introduced for any species, and the number of animals can be increased or decreased at any time, just like in the real world.",
    "materials": "FoodChain",
    "title": "Food Chain",
    "resource": 381,
    "answers": ["D", "C", "A", "D", "A"]
  },
  {
    "title": "Protein Synthesis STEM Case",
    "resource": 3114,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "description": "Observe and manipulate the populations of four creatures (trees, deer, bears, and mushrooms) in a forest. Investigate the feeding relationships (food web) in the forest. Determine which creatures are producers, consumers, and decomposers. Pictographs and line graphs show changes in populations over time.",
    "materials": "ForestEcosystem",
    "title": "Forest Ecosystem",
    "resource": 639,
    "answers": ["B", "A", "C", "A", "B"]
  },
  {
    "description": "Scan the DNA of frogs to produce DNA sequences. Use the DNA sequences to identify possible identical twins and to determine which sections of DNA code for skin color, eye color, and the presence or absence of spots.",
    "materials": "DNAAnalysis",
    "title": "DNA Analysis",
    "resource": 406,
    "answers": []
  },
  {
    "title": "Meowsis STEM Case",
    "resource": 3044,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "title": "Evolution STEM Case",
    "resource": 3004,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "materials": "Meiosis",
    "title": "Meiosis",
    "description": "Explore how sex cells are produced by the process of meiosis. Compare meiosis in male and female germ cells, and use crossovers to increase the number of possible gamete genotypes. Using meiosis and crossovers, create \"designer\" fruit fly offspring with desired trait combinations.",
    "resource": 1070,
    "answers": ["B", "B", "C", "D", "B"]
  },
  {
    "materials": "RNAProteinSynthesis",
    "title": "RNA and Protein Synthesis",
    "description": "Go through the process of synthesizing proteins through RNA transcription and translation. Learn about the many steps involved in protein synthesis including: unzipping of DNA, formation of mRNA, attaching of mRNA to the ribosome, and linking of amino acids to form a protein.",
    "resource": 442,
    "answers": ["C", "A", "B", "A", "D"]
  },
  {
    "description": "You are a bird hunting moths (both dark and light) that live on trees. As you capture the moths most easily visible against the tree surface, the moth populations change, illustrating the effects of natural selection.",
    "materials": "NaturalSelection",
    "title": "Natural Selection",
    "resource": 447,
    "answers": ["A", "D", "C", "A", "D"]
  },
  {
    "description": "Observe evolution in a fictional population of bugs. Set the background to any color, and see natural selection taking place. Inheritance of color occurs according to Mendel's laws and probability. Mutations occur at random, and probability of capture by predators is determined by the insect's camouflage.",
    "materials": "EvolutionMutationSelection",
    "title": "Evolution: Mutation and Selection",
    "resource": 554,
    "answers": ["C", "D", "B", "C", "C"]
  },
  {
    "materials": "Senses",
    "title": "Senses",
    "description": "Everything we know about the world comes through our senses: sight, hearing, touch, taste, and smell. In the Senses Gizmo, explore how stimuli are detected by specialized cells, transmitted through nerves, and processed in the brain.",
    "resource": 1069,
    "answers": ["C", "A", "B", "D", "B"]
  },
  {
    "description": "Observe evolution in a fictional population of bugs. Set the background to any color, and see natural selection taking place. Compare the processes of natural and artificial selection. Manipulate the mutation rate, and determine how mutation rate affects adaptation and evolution.",
    "materials": "EvolutionNaturalArtificial",
    "title": "Evolution: Natural and Artificial Selection",
    "resource": 575,
    "answers": ["A", "C", "A", "C", "B"]
  },
  {
    "materials": "HumanEvolution",
    "title": "Human Evolution - Skull Analysis",
    "description": "Compare the skulls of a variety of significant human ancestors, or hominids. Use available tools to measure lengths, areas, and angles of important features. Each skull can be viewed from the front, side, or from below. Additional information regarding the age, location, and discoverer of each skull can be displayed.",
    "resource": 576,
    "answers": ["D", "A", "B", "C", "B"]
  },
  {
    "description": "Study the thickness of birds' beaks over a five year period as you control the yearly rainfall on an isolated island. As the environmental conditions change, the species must adapt (a real-world consequence) to avoid extinction.",
    "materials": "RainfallBirdMetric",
    "title": "Rainfall and Bird Beaks - Metric",
    "resource": 620,
    "answers": ["A", "B", "A", "A", "C"]
  },
  {
    "description": "Use dichotomous keys to identify and classify five types of organisms: California albatrosses, Canadian Rockies buttercups, Texas venomous snakes, Virginia evergreens, and Florida cartilagenous fishes. After you have classified every organism, try making your own dichotomous key!",
    "materials": "DichotomousKeys",
    "title": "Dichotomous Keys",
    "resource": 1047,
    "answers": ["B", "D", "A", "D", "C"]
  },
  {
    "materials": "Cladograms",
    "title": "Cladograms",
    "description": "Based on the similarities and differences between different organisms, create branching diagrams called cladograms to show how they are related. Use both morphological data (physical traits) and molecular data to create the simplest and most likely cladograms. Five different sets of organisms are available.",
    "resource": 1076,
    "answers": ["C", "C", "C", "B", "D"]
  },
  {
    "description": "When a foreign substance such as a drug is ingested, it often remains in the bloodstream for a long time. This Gizmo models the elimination of substances from the bloodstream using water and dye. Add dye to a container of water, and then add beakers of pure water while removing beakers of dyed water. The amount of dye remaining is recorded after each cycle. The volumes of all containers can be adjusted, as well as the amount of dye used. This provides a good example of exponential decay.",
    "materials": "DyeElimination",
    "title": "Dye Elimination",
    "resource": 516,
    "answers": ["A", "C", "B", "C", "C"]
  },
  {
    "title": "Photosynthesis STEM Case",
    "resource": 3054,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "materials": "PrairieEcosystem",
    "title": "Prairie Ecosystem",
    "description": "Observe the populations of grass, prairie dogs, ferrets and foxes in a prairie ecosystem. Investigate feeding relationships and determine the food chain. Bar graphs and line graphs show changes in populations over time.",
    "resource": 647,
    "answers": ["B", "A", "D", "B", "C"]
  },
  {
    "description": "Study the thickness of birds' beaks over a five-year period as you control the yearly rainfall on an isolated island. As the environmental conditions change, the species must adapt (a real-world consequence) to avoid extinction.",
    "materials": "RainfallBirdBeaks",
    "title": "Rainfall and Bird Beaks",
    "resource": 404,
    "answers": ["A", "B", "A", "A", "C"]
  },
  {
    "description": "Sort and pair the images of human chromosomes obtained in a scan. Find differences in the scans of the various patients to find out specific things that can cause disease, as well as determining the sex of the person.",
    "materials": "HumanKaryotyping",
    "title": "Human Karyotyping",
    "resource": 440,
    "answers": ["C", "B", "B", "D", "A"]
  },
  {
    "materials": "DrugDosage",
    "title": "Drug Dosage",
    "description": "A drug prescription must be carefully planned to maximize benefit while avoiding an overdose. In this Gizmo, you can give a patient one or more pills and monitor the levels of medication in the body through time. Based on the reaction of the patient, determine the ideal levels of medication. Create a dosage schedule so these levels are maintained through time. Four types of pills, each with a different release pattern and target organ, are available for use.",
    "resource": 525,
    "answers": ["C", "D", "D", "B", "A"]
  },
  {
    "materials": "MouseGenetics2",
    "title": "Mouse Genetics (Two Traits)",
    "description": "Breed \"pure\" mice with known genotypes that exhibit specific fur and eye colors, and learn how traits are passed on via dominant and recessive genes. Mice can be stored in cages for future breeding, and the statistics of fur and eye color are reported every time a pair of mice breed. Punnett squares can be used to predict results.",
    "resource": 382,
    "answers": ["D", "A", "A", "B", "B"]
  },
  {
    "materials": "MouseGenetics",
    "title": "Mouse Genetics (One Trait)",
    "description": "Breed \"pure\" mice with known genotypes that exhibit specific fur colors, and learn how traits are passed on via dominant and recessive genes. Mice can be stored in cages for future breeding, and the statistics of fur color are reported every time a pair of mice breed. Punnett squares can be used to predict results.",
    "resource": 449,
    "answers": ["D", "B", "A", "D", "D"]
  },
  {
    "materials": "EstPopulationSize",
    "title": "Estimating Population Size",
    "description": "Adjust the number of fish in a lake to be tagged and the number of fish to be recaptured. Use the number of tagged fish in the catch to estimate the number of fish in the lake.",
    "resource": 261,
    "answers": ["B", "B", "B", "C", "A"]
  },
  {
    "description": "Use a scalpel, forceps, and pins to dissect realistic male and female frogs. Organs can be removed and placed into organ system diagrams. Once the dissections are complete, the frog organ systems can be compared. Zooming, rotating, and panning tools are available to examine the frog from any angle.",
    "materials": "FrogDissection",
    "title": "Frog Dissection",
    "resource": 1097,
    "answers": ["B", "C", "A", "D", "C"]
  },
  {
    "description": "Select a sample cell from an animal, plant, or bacterium and view the cell under a microscope. Select each organelle on the image to learn more about its structure and function. Closeup views and animations of certain organelles is provided.",
    "materials": "CellStructure",
    "title": "Cell Structure",
    "resource": 450,
    "answers": ["B", "C", "D", "C", "C"]
  },
  {
    "materials": "CellDivision",
    "title": "Cell Division",
    "description": "Begin with a single cell and watch as mitosis and cell division occurs. The cells will go through the steps of interphase, prophase, metaphase, anaphase, telophase, and cytokinesis. The length of the cell cycle can be controlled, and data related to the number of cells present and their current phase can be recorded.",
    "resource": 443,
    "answers": ["C", "B", "A", "D", "A"]
  },
  {
    "description": "Observe the spread of disease through a group of people. The methods of transmission can be chosen and include person-to-person, airborne, and foodborne as well as any combination thereof. The probability of each form of transmission and number of people in the group can also be adjusted.",
    "materials": "DiseaseSpread",
    "title": "Disease Spread",
    "resource": 379,
    "answers": ["A", "D", "C", "A", "C"]
  },
  {
    "description": "Set the initial percentages of three types of parrots in a population and track changes in genotype and allele frequency through several generations. Analyze population data to develop an understanding of the Hardy-Weinberg equilibrium. Determine how initial allele percentages will affect the equilibrium state of the population.",
    "materials": "HardyWeinberg",
    "title": "Hardy-Weinberg Equilibrium",
    "resource": 517,
    "answers": ["B", "C", "B", "C", "B"]
  },
  {
    "description": "Observe the effect of predators on a population of parrots with three possible genotypes. The initial percentages and fitness levels of each genotype can be set. Determine how initial fitness levels affect genotype and allele frequencies through several generations. Compare scenarios in which a dominant allele is deleterious, a recessive allele is deleterious, and the heterozygous individual is fittest.",
    "materials": "Microevolution",
    "title": "Microevolution",
    "resource": 521,
    "answers": ["A", "D", "A", "D", "C"]
  },
  {
    "materials": "ParameciumHomeostasis",
    "title": "Paramecium Homeostasis",
    "description": "Observe how a paramecium maintains stable internal conditions in a changing aquatic environment. Water moves into the organism by osmosis, and is pumped out by the contractile vacuole. The concentration of solutes in the water will determine the rate of contractions in the paramecium.",
    "resource": 520,
    "answers": ["B", "D", "D", "A", "A"]
  },
  {
    "materials": "SeedGermination",
    "title": "Seed Germination",
    "description": "Perform experiments with several seed types to see what conditions yield the highest germination (sprouting) rate. Three different types of seeds can be studied, and the temperature, water and light in the germination chamber can be controlled. No two trials will have the same result so repeated trials are recommended.",
    "resource": 378,
    "answers": ["C", "A", "D", "B", "B"]
  },
  {
    "materials": "TempSexDetermination",
    "title": "Temperature and Sex Determination",
    "description": "Observe the sex ratios of birds and geckos as they hatch in an incubator. Vary the temperature of the incubator and measure the percentages of male and female hatchlings to determine if temperature has an effect on sex.",
    "resource": 376,
    "answers": ["A", "D", "C", "C", "B"]
  },
  {
    "materials": "DistanceTime",
    "title": "Distance-Time Graphs",
    "description": "Create a graph of a runner's position versus time and watch the runner complete a 40-yard dash based on the graph you made. Notice the connection between the slope of the line and the speed of the runner. What will the runner do if the slope of the line is zero? What if the slope is negative? Add a second runner (a second graph) and connect real-world meaning to the intersection of two graphs.",
    "resource": 260,
    "answers": ["B", "D", "A", "D", "C"]
  },
  {
    "materials": "TempSexDeterminationMetric",
    "title": "Temperature and Sex Determination - Metric",
    "description": "Observe the sex ratios of birds and geckos as they hatch in an incubator. Vary the temperature of the incubator and measure the percentages of male and female hatchlings to determine if temperature has an effect on sex.",
    "resource": 621,
    "answers": ["A", "D", "C", "C", "B"]
  },
  {
    "materials": "DistanceTimeVelocity",
    "title": "Distance-Time and Velocity-Time Graphs",
    "description": "Create a graph of a runner's position versus time and watch the runner run a 40-yard dash based on the graph you made. Notice the connection between the slope of the line and the velocity of the runner. Add a second runner (a second graph) and connect real-world meaning to the intersection of two graphs. Also experiment with a graph of velocity versus time for the runners, and also distance traveled versus time.",
    "resource": 301,
    "answers": ["A", "D", "C", "B", "C"]
  },
  {
    "materials": "Vectors",
    "title": "Vectors",
    "description": "Manipulate the magnitudes and directions of two vectors to generate a sum and learn vector addition. The x and y components can be displayed, along with the dot product of the two vectors.",
    "resource": 415,
    "answers": ["A", "A", "B", "C", "A"]
  },
  {
    "materials": "DistanceTimeVelocityS",
    "title": "Distance-Time and Velocity-Time Graphs - Metric",
    "description": "Create a graph of a runner's position versus time and watch the runner run a 40-meter dash based on the graph you made. Notice the connection between the slope of the line and the velocity of the runner. Add a second runner (a second graph) and connect real-world meaning to the intersection of two graphs. Also experiment with a graph of velocity versus time for the runners, and also distance traveled versus time.",
    "resource": 626,
    "answers": ["A", "D", "C", "B", "C"]
  },
  {
    "description": "Try to get a hole in one by adjusting the velocity and launch angle of a golf ball. Explore the physics of projectile motion in a frictional or ideal setting. Horizontal and vertical velocity vectors can be displayed, as well as the path of the ball. The height of the golfer and the force of gravity are also adjustable.",
    "materials": "GolfRange",
    "title": "Golf Range",
    "resource": 26,
    "answers": ["B", "C", "B", "A", "D"]
  },
  {
    "description": "Fire a banana cannon at a monkey in a tree. The monkey drops from the tree at the moment the banana is fired from the cannon. Determine where to aim the cannon so the monkey catches the banana. The position of the cannon, launch angle and initial velocity of the banana can be varied. Students can observe the velocity vectors and the paths of the monkey and banana.",
    "materials": "FeedMonkey",
    "title": "Feed the Monkey (Projectile Motion)",
    "resource": 609,
    "answers": ["B", "D", "C", "B", "A"]
  },
  {
    "materials": "DistanceTimeS",
    "title": "Distance-Time Graphs - Metric",
    "description": "Create a graph of a runner's position versus time and watch the runner complete a 40-meter dash based on the graph you made. Notice the connection between the slope of the line and the speed of the runner. What will the runner do if the slope of the line is zero? What if the slope is negative? Add a second runner (a second graph) and connect real-world meaning to the intersection of two graphs.",
    "resource": 625,
    "answers": ["B", "D", "A", "D", "C"]
  },
  {
    "materials": "PotentialEnergyShelves",
    "title": "Potential Energy on Shelves",
    "description": "Compare the potential energy of several objects when you place them on shelves of different heights. Learn that two objects at different heights can have the same potential energy, while two objects at the same height can have different potential energies.",
    "resource": 399,
    "answers": ["D", "C", "A", "C", "D"]
  },
  {
    "description": "Perform experiments with a pendulum to gain an understanding of energy conservation in simple harmonic motion. The mass, length, and gravitational acceleration of the pendulum can be adjusted, as well as the initial angle. The potential energy, kinetic energy, and total energy of the oscillating pendulum can be displayed on a table, bar chart or graph.",
    "materials": "EnergyPendulum",
    "title": "Energy of a Pendulum",
    "resource": 390,
    "answers": ["B", "C", "D", "C", "D"]
  },
  {
    "description": "Investigate the energy and motion of a block sliding down an inclined plane, with or without friction. The ramp angle can be varied and a variety of materials for the block and ramp can be used. Potential and kinetic energy are reported as the block slides down the ramp. Two experiments can be run simultaneously to compare results as factors are varied.",
    "materials": "InclinedPlaneSliding",
    "title": "Inclined Plane - Sliding Objects",
    "resource": 27,
    "answers": ["D", "C", "A", "A", "B"]
  },
  {
    "materials": "TorqueMomentInertia",
    "title": "Torque and Moment of Inertia",
    "description": "One of the simplest machines is a see-saw lever. Place up to eight objects on the lever at different locations and try to balance it. Calculate net torque and moment of inertia based on the positions of the objects and the mass of the bar. The mass of each object can be changed, and the fulcrum position can be shifted as well.",
    "resource": 522,
    "answers": ["D", "B", "C", "C", "D"]
  },
  {
    "materials": "UniformCircularMotion",
    "title": "Uniform Circular Motion",
    "description": "Measure the position, velocity, and acceleration (both components and magnitude) of an object undergoing circular motion. The radius and velocity of the object can be controlled, along with the mass of the object. The forces acting on the object also can be recorded.",
    "resource": 423,
    "answers": ["D", "D", "B", "D", "C"]
  },
  {
    "description": "Drag blocks onto a two-dimensional surface and observe the effects on the center of mass. Use a grid to calculate the coordinates of the center of mass. Investigate predefined shapes or your own arrangements of blocks.",
    "materials": "CenterMass",
    "title": "Center of Mass",
    "resource": 606,
    "answers": []
  },
  {
    "description": "Observe and compare objects of different shapes as they roll or slide down an inclined plane. Compare the percentages of translational and rotational kinetic energy for each object, and see how this affects how quickly each object moves. The slope of each ramp can be adjusted, and a variety of materials can be used for the objects and ramps.",
    "materials": "InclinedPlaneRolling",
    "title": "Inclined Plane - Rolling Objects",
    "resource": 587,
    "answers": ["B", "A", "A", "B", "D"]
  },
  {
    "materials": "PhaseChanges",
    "title": "Phase Changes",
    "description": "Explore the relationship between molecular motion, temperature, and phase changes. Compare the molecular structure of solids, liquids, and gases. Graph temperature changes as ice is melted and water is boiled. Find the effect of altitude on phase changes. The starting temperature, ice volume, altitude, and rate of heating or cooling can be adjusted.",
    "resource": 557,
    "answers": ["C", "D", "A", "B", "A"]
  },
  {
    "materials": "TempParticle",
    "title": "Temperature and Particle Motion",
    "description": "Observe the movement of particles of an ideal gas at a variety of temperatures. A histogram showing the Maxwell-Boltzmann velocity distribution is shown, and the most probable velocity, mean velocity, and root mean square velocity can be calculated. Molecules of different gases can be compared.",
    "resource": 555,
    "answers": ["D", "B", "A", "C", "A"]
  },
  {
    "description": "Two flasks hold colored water, one yellow and the other blue. Set the starting temperature of each flask, choose a type of material to connect the flasks, and see how quickly the flasks heat up or cool down. The flasks can be connected with a hollow pipe, allowing the water in the flasks to mix, or a solid chunk that transfers heat but prevents mixing.",
    "materials": "ConductionConvection",
    "title": "Conduction and Convection",
    "resource": 658,
    "answers": ["A", "B", "A", "C", "D"]
  },
  {
    "materials": "SledWars",
    "title": "Sled Wars",
    "description": "Explore acceleration, speed, momentum, and energy by sending a sled down a hill into a group of snowmen. The starting height and mass of the sled can be changed, as well as the number of snowmen. In the Two sleds scenario, observe collisions between sleds of different masses and starting heights.",
    "resource": 1055,
    "answers": ["D", "A", "B", "B", "D"]
  },
  {
    "description": "Use a lever to lift a pig, turkey, or sheep. A strongman provides up to 1000 newtons of effort. The fulcrum, strongman, and animals can be moved to any position to create first-, second-, or third-class levers.",
    "materials": "Levers",
    "title": "Levers",
    "resource": 646,
    "answers": ["A", "C", "C", "C", "A"]
  },
  {
    "description": "Place masses on a circular table and see how fast it spins when struck by a piston. Discover the relationships between angular velocity, mass, radius and moment of inertia for collections of point-masses, rings, disks, and more complex shapes.",
    "materials": "MomentInertia",
    "title": "Moment of Inertia",
    "resource": 605,
    "answers": ["C", "D", "B", "B", "C"]
  },
  {
    "description": "Use a pulley system to lift a heavy weight to a certain height. Measure the force required to lift the weight using up to three fixed and three movable pulleys. The weight to be lifted and the efficiency of the pulley system can be adjusted, and the height of the weight and the total input distance are reported.",
    "materials": "PulleyLab",
    "title": "Pulley Lab",
    "resource": 572,
    "answers": ["A", "C", "C", "C", "C"]
  },
  {
    "description": "Observe the five main types of nuclear decay: alpha decay, beta decay, gamma decay, positron emission, and electron capture. Write nuclear equations by determining the mass numbers and atomic numbers of daughter products and emitted particles.",
    "materials": "NuclearDecay",
    "title": "Nuclear Decay",
    "resource": 490,
    "answers": ["B", "B", "D", "A", "A"]
  },
  {
    "description": "Investigate the properties of an ideal gas by performing experiments in which the temperature is held constant (Boyle's Law), and others in which the pressure remains fixed (Charles's Law). The pressure is controlled through the placement of masses on the lid of the container, and temperature is controlled with an adjustable heat source. Gay-Lussac's law relating pressure to temperature can also be explored by keeping the volume constant.",
    "materials": "BoylesCharles",
    "title": "Boyle's Law and Charles's Law",
    "resource": 422,
    "answers": ["C", "B", "A", "D", "A"]
  },
  {
    "materials": "IdealGasLaw",
    "title": "Ideal Gas Law",
    "description": "Explore relationships between amount, temperature, pressure, and volume for an ideal gas in a chamber with a moveable piston. Discover rules of proportionality contained in Boyle's law, Charles's law, Avogadro's law, and Gay-Lussac's law. Use these relationships to derive the ideal gas law and calculate the value of the ideal gas constant.",
    "resource": 1094,
    "answers": ["A", "B", "C", "A", "B"]
  },
  {
    "materials": "WheelAxle",
    "title": "Wheel and Axle",
    "description": "Use a wheel and axle to move a heavy load. Find out how many athletes it takes to move the load under different conditions. The radii of the wheel and the axle can be adjusted to help study mechanical advantage.",
    "resource": 654,
    "answers": ["A", "B", "D", "B", "C"]
  },
  {
    "description": "Investigate how an inclined plane redirects and reduces the force pulling a brick downward, with or without friction. A toy car can apply a variable upward force on the brick, and the mechanical advantage and efficiency of the plane can be determined. A graph of force versus distance illustrates the concept of work.",
    "materials": "InclinedPlaneSimpleMachine",
    "title": "Inclined Plane - Simple Machine",
    "resource": 604,
    "answers": ["C", "A", "D", "B", "C"]
  },
  {
    "description": "Launch a charged particle into a chamber. Charged particles can be added into the chamber to influence the path of the moving particle. The launch speed can be changed as well. Try to match a given path by manipulating the fixed particles in the chamber.",
    "materials": "ChargeLauncher",
    "title": "Charge Launcher",
    "resource": 632,
    "answers": ["C", "D", "C", "B", "B"]
  },
  {
    "materials": "Magnetism",
    "title": "Magnetism",
    "description": "Drag bar magnets and a variety of other objects onto a piece of paper. Click Play to release the objects to see if they are attracted together, repelled apart, or unaffected. You can also sprinkle iron filings over the magnets and other objects to view the magnetic field lines that are produced.",
    "resource": 631,
    "answers": ["D", "B", "A", "B", "A"]
  },
  {
    "description": "Drag two charged particles around and observe the Coulomb force between them as their positions change. The charge of each object can be adjusted, and the force is displayed both numerically and with vectors as the distance between the objects is altered.",
    "materials": "CoulombForce",
    "title": "Coulomb Force (Static)",
    "resource": 456,
    "answers": []
  },
  {
    "materials": "PithBallLab",
    "description": "Pith balls with positive, negative, or no electrical charge are suspended from strings. The charge and mass of the pith balls can be adjusted, along with the length of the string, which will cause the pith balls to change position. Distances can be measured as variables are adjusted, and the forces (Coulomb and gravitational) acting on the balls can be displayed.",
    "title": "Pith Ball Lab",
    "resource": 459,
    "answers": ["B", "C", "A", "C", "D"]
  },
  {
    "materials": "Waves",
    "title": "Waves",
    "description": "Observe and measure transverse, longitudinal, and combined waves on a model of a spring moved by a hand. Adjust the amplitude and frequency of the hand, and the tension and density of the spring. The speed and power of the waves is reported, and the wavelength and amplitude can be measured.",
    "resource": 1053,
    "answers": ["C", "B", "A", "D", "D"]
  },
  {
    "description": "Observe the propagation of longitudinal (compression) waves in a closed or open tube with evenly-spaced dividers. The strength and frequency of the waves can be manipulated, or waves can be observed as individual pulses. Compare the movement of dividers to graphs of displacement, velocity, acceleration and pressure.",
    "materials": "LongitudinalWaves",
    "title": "Longitudinal Waves",
    "resource": 610,
    "answers": ["B", "D", "B", "D", "B"]
  },
  {
    "description": "Test your hearing range by listening to low-, medium-, and high-frequency sounds. Compare the relative loudness of sounds at each frequency to create an equal-loudness curve. In a quiet room, measure your threshold of audibility for each frequency, and compare your results to others. The volume of each sound can be adjusted.",
    "materials": "HearingFreqVolume",
    "title": "Hearing: Frequency and Volume",
    "resource": 518,
    "answers": ["A", "D", "C", "B", "B"]
  },
  {
    "materials": "SoundBeatsSineWaves%20",
    "title": "Sound Beats and Sine Waves",
    "description": "Listen to and see interference patterns produced by sound waves with similar frequencies. Test your ability to distinguish and match sounds as musicians do when they tune their instruments. Calculate the number of \"sound beats\" you will hear based on the frequency of each sound. [Note: Headphones are recommended for this Gizmo.]",
    "resource": 524,
    "answers": ["A", "D", "B", "C", "B"]
  },
  {
    "description": "Point a laser at a mirror and compare the angle of the incoming beam to the angle of reflection. A protractor can be used to measure the angles of incidence and reflection, and the angle of the mirror can be adjusted. A beam splitter can be used to split the beam. Both plane and irregular mirrors can be used.",
    "materials": "LaserReflection",
    "title": "Laser Reflection",
    "resource": 414,
    "answers": ["C", "B", "C", "B", "D"]
  },
  {
    "materials": "Refraction",
    "title": "Refraction",
    "description": "Determine the angle of refraction for a light beam moving from one medium to another. The angle of incidence and each index of refraction can be varied. Using the tools provided, the angle of refraction can be measured, and the wavelength and frequency of the waves in each substance can be compared as well.",
    "resource": 552,
    "answers": ["D", "C", "A", "B", "B"]
  },
  {
    "description": "Mix the primary colors of light by using red, green, and blue lights. Use pieces of colored glass to filter the light and create a wide variety of colors. Determine how light is absorbed and transmitted by each color of glass.",
    "materials": "ColorAbsorption",
    "title": "Color Absorption",
    "resource": 652,
    "answers": ["C", "C", "A", "C", "C"]
  },
  {
    "description": "Shine a powerful flashlight on a variety of materials, and measure how quickly each material heats up. See how the light angle, light color, type of material, and material color affect heating. A glass cover can be added to simulate a greenhouse.",
    "materials": "HeatAbsorption",
    "title": "Heat Absorption",
    "resource": 655,
    "answers": ["A", "B", "A", "B", "C"]
  },
  {
    "description": "Use a powerful flashlight to pop a kernel of popcorn. A lens focuses light on the kernel. The temperature of the filament and the distance between the flashlight and lens can be changed. Several obstacles can be placed between the flashlight and the popcorn.",
    "materials": "Radiation",
    "title": "Radiation",
    "resource": 665,
    "answers": ["C", "A", "D", "D", "D"]
  },
  {
    "description": "Shine sunlight through a prism and use a thermometer to measure the temperature in different regions of the spectrum. The thermometer can be dragged through the visible spectrum and beyond. This recreates the experiment of William Herschel that led to the discovery of infrared radiation in 1800.",
    "materials": "HerschelExperiment",
    "title": "Herschel Experiment",
    "resource": 389,
    "answers": ["C", "B", "D", "A", "A"]
  },
  {
    "description": "Shine sunlight through a prism and use a thermometer to measure the temperature in different regions of the spectrum. The thermometer can be dragged through the visible spectrum and beyond. This recreates the experiment of William Herschel that led to the discovery of infrared radiation in 1800.",
    "materials": "HerschelExperimentMetric",
    "title": "Herschel Experiment - Metric",
    "resource": 622,
    "answers": ["C", "B", "D", "A", "A"]
  },
  {
    "description": "Observe sound waves emitted from a moving vehicle. Measure the frequency of sound waves in front of and behind the vehicle as it moves, illustrating the Doppler effect. The frequency of sound waves, speed of the source, and the speed of sound can all be manipulated. Motion of the vehicle can be linear, oscillating, or circular.",
    "materials": "DopplerShift",
    "title": "Doppler Shift",
    "resource": 363,
    "answers": ["D", "A", "B", "B", "D"]
  },
  {
    "materials": "SeeingColor",
    "description": "Observe how different colors of light are reflected or absorbed by colored objects. Determine that white light is a combination of different colors of light, and that one or more component colors may be reflected when white light is shone on an object. Understand that we see an object when light reflected from the object enters our eye.",
    "title": "Eyes and Vision 1 - Seeing Color",
    "resource": 1095,
    "answers": ["B", "A", "A", "D", "C"]
  },
  {
    "description": "Shoot a beam of light at a metal plate in a virtual lab and observe the effect on surface electrons. The type of metal as well as the wavelength and amount of light can be adjusted. An electric field can be created to resist the electrons and measure their initial energies.",
    "materials": "PhotoelectricEffect",
    "title": "Photoelectric Effect",
    "resource": 491,
    "answers": ["B", "D", "A", "B", "A"]
  },
  {
    "description": "Once light enters the eye, it must be focused on the retina. Manipulate the pupil diameter to regulate the amount of light that enters then eye, then change the lens shape to focus light. Determine the changes in lens shape needed to maintain focus as the object distance changes. This is a followup to the Eyes and Vision 1 - Seeing Colors lesson.",
    "materials": "FocusingLight",
    "title": "Eyes and Vision 2 - Focusing Light",
    "resource": 1102,
    "answers": ["D", "C", "B", "D", "B"]
  },
  {
    "description": "Gain an understanding of Newton's Laws by experimenting with a cart (on which up to three fans are placed) on a linear track. The cart has a mass, as does each fan. The fans exert a constant force when switched on, and the direction of the fans can be altered as the position, velocity, and acceleration of the cart are measured.",
    "materials": "FanCartPhysics",
    "title": "Fan Cart Physics",
    "resource": 403,
    "answers": []
  },
  {
    "description": "Place weights into a boat and see how far the boat sinks into a tank of liquid. The depth of the boat can be measured, as well as the amount of liquid displaced. The dimensions of the boat and the density of the liquid can be adjusted. See how much weight the boat can hold before it sinks to the bottom!",
    "materials": "ArchimedesPrinciple",
    "title": "Archimedes' Principle",
    "resource": 603,
    "answers": ["C", "B", "C", "D", "B"]
  },
  {
    "materials": "RollerCoaster",
    "title": "Roller Coaster Physics",
    "description": "Adjust the hills on a toy-car roller coaster and watch what happens as the car careens toward an egg (that can be broken) at the end of the track. The heights of three hills can be manipulated, along with the mass of the car and the friction of the track. A graph of various variables of motion can be viewed as the car travels, including position, speed, acceleration, potential energy, kinetic energy, and total energy.",
    "resource": 405,
    "answers": ["D", "C", "A", "A", "D"]
  },
  {
    "description": "Measure the height and velocity of two objects connected by a massless rope over a pulley. Observe the forces acting on each mass throughout the simulation. Calculate the acceleration of the objects, and relate these calculations to Newton's Laws of Motion. The mass of each object can be manipulated, as well as the mass and radius of the pulley.",
    "materials": "AtwoodMachine",
    "title": "Atwood Machine",
    "resource": 523,
    "answers": ["B", "B", "A", "D", "B"]
  },
  {
    "description": "Investigate the motion of an object as it falls to the ground. A variety of objects can be compared, and their motion can be observed in a vacuum, in normal air, and in denser air. The position, velocity, and acceleration are measured over time, and the forces on the object can be displayed. Using the manual settings, the mass, radius, height, and initial velocity of the object can be adjusted, as can the air density and wind.",
    "materials": "FreeFall",
    "title": "Free-Fall Laboratory",
    "resource": 387,
    "answers": ["A", "B", "D", "B", "B"]
  },
  {
    "materials": "SensingLight",
    "description": "Observe how photoreceptors on the retina are stimulated by different colors of light. Determine that cone cells are stimulated by specific colors of light and enable us to see color, while rod cells are stimulated by various colors and do not contribute to color vision. Experiment by varying the percentage of rod and cone cells in normal and dim light to see how rod cells help with night vision.",
    "title": "Eyes and Vision 3 - Sensing Light",
    "resource": 1103,
    "answers": ["A", "D", "B", "D", "A"]
  },
  {
    "materials": "SimpleHarmonicMotion",
    "title": "Simple Harmonic Motion",
    "description": "Observe two different forms of simple harmonic motion: a pendulum and a spring supporting a mass. Use a stopwatch to measure the period of each device as you adjust the mass hanging from the spring, the spring constant, the mass of the pendulum, the length of the pendulum, and the gravitational acceleration.",
    "resource": 44,
    "answers": ["C", "A", "B", "C", "B"]
  },
  {
    "description": "Place a pan on the end of a hanging spring. Measure how much the spring stretches when various masses are added to the pan. Create a graph of displacement vs. mass to determine the spring constant of the spring.",
    "materials": "DeterminingSpringConstant",
    "title": "Determining a Spring Constant",
    "resource": 428,
    "answers": ["A", "B", "C", "D", "C"]
  },
  {
    "description": "Investigate elastic collisions in two dimensions using two frictionless pucks. The mass, velocity, and initial position of each puck can be modified to create a variety of scenarios.",
    "resource": 361,
    "materials": "2DCollisions",
    "title": "2D Collisions",
    "answers": []
  },
  {
    "materials": "HeatTransferConduction",
    "title": "Heat Transfer by Conduction",
    "description": "An insulated beaker of hot water is connected to a beaker of cold water with a conducting bar, and over time the temperatures of the beakers equalize as heat is transferred through the bar. Four materials (aluminum, copper, steel, and glass) are available for the bar.",
    "resource": 388,
    "answers": ["B", "D", "A", "B", "B"]
  },
  {
    "description": "Investigate how calorimetry can be used to find relative specific heat values when different substances are mixed with water. Modify initial mass and temperature values to see effects on the system. One or any combination of the substances can be mixed with water. A dynamic graph (temperature vs. time) shows temperatures of the individual substances after mixing.",
    "materials": "CalorimetryLab",
    "title": "Calorimetry Lab",
    "resource": 460,
    "answers": ["A", "A", "C", "C", "B"]
  },
  {
    "materials": "DopplerAdvanced",
    "title": "Doppler Shift Advanced",
    "description": "Derive an equation to calculate the frequency of an oncoming sound source and a receding sound source. Also, calculate the Doppler shift that results from a moving observer and a stationary sound source. The source velocity, sound velocity, observer velocity, and sound frequency can all be manipulated.",
    "resource": 584,
    "answers": ["D", "C", "B", "D", "A"]
  },
  {
    "description": "Measure the strength and direction of the magnetic field at different locations in a laboratory. Compare the strength of the induced magnetic field to Earth's magnetic field. The direction and magnitude of the inducting current can be adjusted.",
    "materials": "MagneticInduction",
    "title": "Magnetic Induction",
    "resource": 611,
    "answers": ["D", "B", "A", "A", "B"]
  },
  {
    "materials": "PeriodMassSpring",
    "title": "Period of Mass on a Spring",
    "description": "Measure the period of a mass on the end of a spring. Determine the effects of gravitational acceleration, mass, and the spring constant on the period of the spring. Create an equation for the period of a spring given its mass and spring constant.",
    "resource": 421,
    "answers": ["C", "A", "C", "D", "B"]
  },
  {
    "materials": "EnergyConversionSystem",
    "title": "Energy Conversion in a System",
    "description": "A falling cylinder is attached to a rotating propeller that stirs and heats the water in a beaker. The mass and height of the cylinder, as well as the quantity and initial temperature of water can be adjusted. The temperature of the water is measured as energy is converted from one form to another.",
    "resource": 416,
    "answers": ["A", "D", "C", "C", "B"]
  },
  {
    "description": "Explore how a changing magnetic field can induce an electric current. A magnet can be moved up or down at a constant velocity below a loop of wire, or the loop of wire may be dragged in any direction or rotated. The magnetic and electric fields can be displayed, as well as the magnetic flux and the current in the wire.",
    "materials": "ElectromagneticInduction",
    "title": "Electromagnetic Induction",
    "resource": 1044,
    "answers": ["D", "D", "D", "A", "C"]
  },
  {
    "description": "Study wave motion, diffraction, interference, and refraction in a simulated ripple tank. A wide variety of scenarios can be chosen, including barriers with one or two gaps, multiple wave sources, reflecting barriers, or submerged rocks. The wavelength and strength of waves can be adjusted, as well as the amount of damping in the tank.",
    "materials": "RippleTank",
    "title": "Ripple Tank",
    "resource": 1043,
    "answers": ["B", "A", "D", "A", "C"]
  },
  {
    "materials": "RayTracingLenses",
    "title": "Ray Tracing (Lenses)",
    "description": "Observe light rays that pass through a convex or concave lens. Manipulate the position of an object and the focal length of the lens and measure the distance and size of the resulting image.",
    "resource": 588,
    "answers": ["A", "B", "B", "C", "A"]
  },
  {
    "description": "Build compound circuits with series and parallel elements. Calculate voltages, resistance, and current across each component using Ohm's law and the equivalent resistance equation. Check your answers using a voltmeter, ammeter, and ohmmeter. Learn the function of fuses as a safety device.",
    "materials": "AdvancedCircuits",
    "title": "Advanced Circuits",
    "resource": 509,
    "answers": ["B", "D", "A", "A", "C"]
  },
  {
    "description": "Understand the phases of the Moon by observing the positions of the Moon, Earth and Sun. A view of the Moon from Earth is shown on the right as the Moon orbits Earth. Learn the names of Moon phases and in what order they occur. Click Play to watch the Moon go around, or click Pause and drag the Moon yourself.",
    "materials": "PhasesMoon",
    "title": "Phases of the Moon",
    "resource": 613,
    "answers": []
  },
  {
    "materials": "RayTracingMirrors",
    "title": "Ray Tracing (Mirrors)",
    "description": "Observe light rays that reflect from a convex or concave mirror. Manipulate the position of an object and the focal length of the mirror and measure the distance and size of the resulting image.",
    "resource": 592,
    "answers": ["D", "A", "A", "A", "B"]
  },
  {
    "materials": "MoonriseMoonset",
    "title": "Moonrise, Moonset, and Phases",
    "description": "Gain an understanding of moonrise and moonset times by observing the relative positions of Earth and the Moon along with a view of the Moon from Earth. A line shows the horizon for a person standing on Earth so that moonrise and moonset times can be determined.",
    "resource": 457,
    "answers": ["D", "B", "A", "B", "B"]
  },
  {
    "description": "Observe the motions of the Earth, Moon and Sun in three dimensions to investigate the causes and frequency of eclipses. Observe Earth's shadow crossing the Moon during a lunar eclipse, and the path of the Moon's shadow across Earth's surface during a solar eclipse. The angle of the Moon's orbit can be adjusted, as well as the distance of the Moon from the Earth.",
    "resource": 462,
    "materials": "3DEclipse",
    "title": "3D Eclipse",
    "answers": ["C", "D", "D", "B", "A"]
  },
  {
    "description": "Shine white light or a single-color beam through a prism. Explore how a prism refracts light and investigate the factors that affect the amount of refraction. The index of refraction of the prism, width of the prism, prism angle, light angle, and light wavelength can be adjusted.",
    "materials": "BasicPrism",
    "title": "Basic Prism",
    "resource": 608,
    "answers": ["D", "A", "C", "A", "B"]
  },
  {
    "materials": "SeasonsWhy",
    "title": "Seasons: Why do we have them?",
    "description": "Learn why the temperature in the summertime is higher than it is in the winter by studying the amount of light striking the Earth. Experiment with a plate detector to measure the amount of light striking the plate as the angle of the plate is adjusted (and then use a group of plates placed at different locations on the Earth) and measure the incoming radiation on each plate.",
    "resource": 407,
    "answers": ["A", "B", "B", "A", "D"]
  },
  {
    "materials": "SeasonsEarthMoonSun",
    "title": "Seasons: Earth, Moon, and Sun",
    "description": "Observe the motions of the Earth, Moon and Sun in three dimensions to explain Sunrise and Sunset, and to see how we define a day, a month, and a year. Compare times of Sunrise and Sunset for different dates and locations. Relate shadows to the position of the Sun in the sky, and relate shadows to compass directions.",
    "resource": 468,
    "answers": ["A", "C", "C", "A", "D"]
  },
  {
    "description": "Use a three dimensional view of the Earth, Moon and Sun to explore seasonal changes at a variety of locations. Strengthen your knowledge of global climate patterns by comparing solar energy input at the Poles to the Equator. Manipulate Earth's axis to increase or diminish seasonal changes.",
    "materials": "SeasonsAroundWorld",
    "title": "Seasons Around the World",
    "resource": 465,
    "answers": ["D", "B", "C", "D", "A"]
  },
  {
    "materials": "Seasons3D",
    "title": "Seasons in 3D",
    "description": "Gain an understanding of the causes of seasons by observing Earth as it orbits the Sun in three dimensions. Observe the path of the Sun across the sky on any date and from any location. Create graphs of solar intensity and day length, and use collected data to describe and explain seasonal changes.",
    "resource": 463,
    "answers": ["B", "C", "A", "D", "C"]
  },
  {
    "description": "Manipulate the position of the Moon to model solar and lunar eclipses. View Earth's shadow, the Moon's shadow, or both. Observe the Moon and Sun from Earth during a partial and total eclipse. The sizes of the three bodies and the Earth-Moon distance can be adjusted.",
    "resource": 556,
    "materials": "2DEclipse",
    "title": "2D Eclipse",
    "answers": ["C", "C", "C", "A", "B"]
  },
  {
    "description": "Survey the solar system, observing the length of a year and the orbital path of each object. The positions of the eight official planets are displayed, as well as one dwarf planet, Pluto. Learn about Kepler's Laws and how planets are classified.",
    "materials": "SolarSystemExplorer",
    "title": "Solar System Explorer",
    "resource": 441,
    "answers": ["B", "D", "A", "B", "A"]
  },
  {
    "materials": "BeamMoon",
    "title": "Beam to Moon (Ratios and Proportions)",
    "description": "Apply ratios and proportions to find the weight of a person on the moon (or on another planet). Weigh an object on Earth and on the moon and weigh the person on Earth. Then set up and solve the proportion of the Earth weights to the moon weights.",
    "resource": 98,
    "answers": ["D", "A", "C", "B", "D"]
  },
  {
    "materials": "GravitationalForce",
    "title": "Gravitational Force",
    "description": "Drag two objects around and observe the gravitational force between them as their positions change. The mass of each object can be adjusted, and the gravitational force is displayed both as vectors and numerically.",
    "resource": 411,
    "answers": ["B", "A", "C", "C", "D"]
  },
  {
    "materials": "OrbitalMotion",
    "title": "Orbital Motion - Kepler's Laws",
    "description": "Learn Kepler's three laws of planetary motion by examining the orbit of a planet around a star. The initial position, velocity, and mass of the planet can be varied as well as the mass of the star. The foci and centers of orbits can be displayed and compared to the location of the star. The area swept out by the planet in a given time period can be measured, and data on orbital radii and periods can be plotted in several ways.",
    "resource": 586,
    "answers": ["A", "B", "D", "B", "C"]
  },
  {
    "materials": "WeightMass",
    "title": "Weight and Mass",
    "description": "Use a balance to measure mass and a spring scale to measure the weight of objects. Compare the masses and weights of objects on Earth, Mars, Jupiter, and the Moon.",
    "resource": 653,
    "answers": ["B", "C", "C", "A", "C"]
  },
  {
    "materials": "BeamMoonMetric",
    "title": "Beam to Moon (Ratios and Proportions) - Metric",
    "description": "Apply ratios and proportions to find the weight of a person on the moon (or on another planet). Weigh an object on Earth and on the moon and weigh the person on Earth. Then set up and solve the proportion of the Earth weights to the moon weights.",
    "resource": 628,
    "answers": ["D", "A", "C", "B", "D"]
  },
  {
    "description": "Imagine a gigantic pitcher standing on Earth, ready to hurl a huge baseball. What will happen as the ball is thrown harder and harder? Find out with the Gravity Pitch Gizmo. Observe the path of the ball when it is thrown at different velocities. Throw the ball on different planets to see how each planet's gravity affects the ball.",
    "materials": "GravityPitch",
    "title": "Gravity Pitch",
    "resource": 648,
    "answers": []
  },
  {
    "materials": "H-RDiagram",
    "title": "H-R Diagram",
    "description": "A collection of stars visible from Earth can be arranged and classified based on their color, temperature, luminosity, radius, and mass. This can be done using one or two-dimensional plots, including a Hertzsprung-Russell diagram of luminosity vs. temperature.",
    "resource": 429,
    "answers": ["C", "B", "D", "B", "D"]
  },
  {
    "description": "Follow in the footsteps of Edwin Hubble to discover evidence supporting the Big Bang Theory. First, observe Cepheid variable stars in different galaxies to determine their distances. Then, measure the redshift from these galaxies to determine their recessional velocity. Create a scatterplot of velocity vs. distance and relate this to an expanding universe.",
    "materials": "BigBang",
    "title": "Big Bang Theory - Hubble's Law",
    "resource": 1057,
    "answers": ["D", "B", "C", "A", "D"]
  },
  {
    "materials": "Nuclear%20Reactions",
    "title": "Nuclear Reactions",
    "description": "Explore examples of nuclear fusion and fission reactions. Follow the steps of the proton-proton chain, CNO cycle, and fission of uranium-235. Write balanced nuclear equations for each step, and compare the energy produced in each process.",
    "resource": 1068,
    "answers": ["B", "C", "A", "B", "D"]
  },
  {
    "materials": "RockCycle",
    "title": "Rock Cycle",
    "description": "Play the role of a piece of rock moving through the rock cycle. Select a starting location and follow many possible paths throughout the cycle. Learn how rocks are formed, weathered, eroded, and reformed as they move from Earth's surface to locations deep within the crust.",
    "resource": 436,
    "answers": ["B", "D", "C", "B", "D"]
  },
  {
    "description": "Observe the motions of Venus and Earth as the planets move around the Sun. Measure the length of a day and a year on Earth and Venus, and compare the length of a solar day to the length of a sidereal day.",
    "materials": "ComparingEarthVenus",
    "title": "Comparing Earth and Venus",
    "resource": 374,
    "answers": ["B", "D", "D", "B", "C"]
  },
  {
    "materials": "StarSpectra",
    "title": "Star Spectra",
    "description": "Analyze the spectra of a variety of stars. Determine the elements that are represented in each spectrum, and use this information to infer the temperature and classification of the star. Look for unusual features such as redshifted stars, nebulae, and stars with large planets.",
    "resource": 558,
    "answers": ["D", "B", "C", "A", "B"]
  },
  {
    "description": "In 1915, Alfred Wegener proposed that all of Earth's continents were once joined in an ancient supercontinent he called Pangaea. Wegener's idea of moving continents led to the modern theory of plate tectonics. Create your own version of Pangaea by fitting Earth's landmasses together like puzzle pieces. Use evidence from fossils, rocks, and glaciers to refine your map.",
    "materials": "BuildingPangaea",
    "title": "Building Pangaea",
    "resource": 633,
    "answers": ["B", "A", "D", "D", "C"]
  },
  {
    "materials": "BuildingTopoMaps",
    "title": "Building Topographic Maps",
    "description": "Build a topographic map by flooding a three dimensional landscape with water and drawing contour lines. Draw a profile of a landscape based on the topographic map.",
    "resource": 493,
    "answers": []
  },
  {
    "materials": "PlateTectonics",
    "title": "Plate Tectonics",
    "description": "Move the Earth's crust at various locations to observe the effects of the motion of the tectonic plates, including volcanic eruptions. Information about each of the major types of plate boundaries is shown, along with their locations on Earth.",
    "resource": 446,
    "answers": ["B", "A", "B", "D", "C"]
  },
  {
    "description": "Weathering is the breakdown of rock at Earth's surface through physical or chemical means. Students will learn about the different types of mechanical and chemical weathering, then use a simulation to model the effects of weathering on different types of rocks in varying climate conditions.",
    "materials": "Weathering",
    "title": "Weathering",
    "resource": 1064,
    "answers": ["C", "B", "D", "C", "B"]
  },
  {
    "materials": "TidesMetric",
    "title": "Tides - Metric",
    "description": "Gain an understanding of high, low, spring, and neap tides on Earth by observing the tidal heights and the position of the Earth, Moon, and Sun. Tidal bulges can be observed from space, and water depths can be recorded from a dock by the ocean.",
    "resource": 616,
    "answers": ["B", "A", "C", "B", "C"]
  },
  {
    "description": "Explore erosion in a simulated 3D environment. Observe how the landscape evolves over time as it is shaped by the forces of flowing water. Vary the initial landscape, rock type, precipitation amount, average temperature, and vegetation and measure how each variable affects the rate of erosion and resulting landscape features.",
    "materials": "ErosionRates",
    "title": "Erosion Rates",
    "resource": 1082,
    "answers": ["D", "D", "C", "A", "B"]
  },
  {
    "materials": "Tides",
    "title": "Tides",
    "description": "Gain an understanding of high, low, spring, and neap tides on Earth by observing the tidal heights and the positions of the Earth, Moon, and Sun. Tidal bulges can be observed from space, and water depths can be recorded from a dock by the ocean.",
    "resource": 368,
    "answers": ["B", "A", "C", "B", "C"]
  },
  {
    "materials": "RiverErosion",
    "title": "River Erosion",
    "description": "Explore how river erosion affects landscapes in the short term and over long periods of time. Describe the features of mountain streams and meandering rivers, and use a floating barrel to estimate current speed. Witness the changes that occur as mountain streams erode downward and meandering rivers erode from side to side.",
    "resource": 1075,
    "answers": ["D", "D", "C", "B", "A"]
  },
  {
    "description": "Use a sonar on a boat to remotely measure the depth of an ocean at various locations. Describe multiple points on the ocean floor using their latitude, longitude, and depth. View maps of ocean depth in two and three dimensions, and use these maps to plot a safe route for ships to follow.",
    "materials": "OceanMapping",
    "title": "Ocean Mapping",
    "resource": 373,
    "answers": ["B", "B", "D", "A", "B"]
  },
  {
    "materials": "FreezingSaltWater",
    "title": "Freezing Point of Salt Water",
    "description": "Control the temperature of a beaker of water. As the temperature drops below the freezing point, a transformation of state will occur that can be viewed on a molecular level. Salt can be added to the water to see its effect on the freezing point of water.",
    "resource": 426,
    "answers": ["A", "C", "B", "B", "D"]
  },
  {
    "description": "Observe daily weather conditions in a coastal region. Measure temperatures and wind speeds at any location and use this data to map convection currents that form during the day and night. Explain the origin of land breezes and sea breezes.",
    "materials": "CoastalWindsClouds",
    "title": "Coastal Winds and Clouds",
    "resource": 438,
    "answers": ["D", "A", "C", "D", "A"]
  },
  {
    "description": "Observe daily weather conditions in a coastal region. Measure temperatures and wind speeds at any location and use this data to map convection currents that form during the day and night. Explain the origin of land breezes and sea breezes.",
    "materials": "CoastalWindsMetric",
    "title": "Coastal Winds and Clouds - Metric",
    "resource": 627,
    "answers": ["D", "A", "C", "D", "A"]
  },
  {
    "description": "Using an earthquake recording station, learn how to determine the distance between the station and an earthquake based on the time difference between the arrival of the primary and secondary seismic waves. Use this data to find the epicenter in the Earthquakes 2 - Location of Epicenter Gizmo.",
    "materials": "Earthquakes1Recording",
    "title": "Earthquakes 1 - Recording Station",
    "resource": 367,
    "answers": ["C", "A", "A", "B", "C"]
  },
  {
    "description": "Use data from up to three weather stations to predict the motion of a hurricane. The wind speed, wind direction, cloud cover and air pressure are provided for each station using standard weather symbols.",
    "materials": "HurricaneMotion",
    "title": "Hurricane Motion",
    "resource": 427,
    "answers": ["C", "B", "D", "A", "B"]
  },
  {
    "materials": "WaterPollution",
    "title": "Water Pollution",
    "description": "Get to know the four main types of pollution present in the environment, and then look at a variety of real-world examples as you try to guess what type of pollution is represented by each situation. All of the real-world situations can be viewed every day in different parts of the world.",
    "resource": 445,
    "answers": ["B", "A", "A", "C", "D"]
  },
  {
    "description": "Within this simulated region of land, daytime's rising temperature and the falling temperature at night can be measured, along with heat flow in and out of the system. The level of greenhouse gases present in the atmosphere at any given time can be adjusted, allowing the long-term effects to be investigated.",
    "materials": "GreenhouseEffect",
    "title": "Greenhouse Effect",
    "resource": 372,
    "answers": ["B", "C", "C", "A", "C"]
  },
  {
    "description": "Locate the epicenter of an earthquake by analyzing seismic data from three recording stations. Measure difference in P- and S-wave arrival times, then use data from the Earthquakes 1 - Recording Station Gizmo to find the distance of the epicenter from each station.",
    "materials": "Earthquakes2Epicenter",
    "title": "Earthquakes 2 - Determination of Epicenter",
    "resource": 371,
    "answers": ["C", "C", "B", "B", "C"]
  },
  {
    "materials": "WeatherMaps",
    "title": "Weather Maps",
    "description": "Learn about standard symbols used in meteorology to construct weather maps. Rain, sleet, snow, temperature, cloud cover, wind speed and direction, and atmospheric pressure can all be recorded at two different weather stations on a map. Describe weather patterns characteristic of high-pressure systems, low-pressure systems, warm fronts, and cold fronts.",
    "resource": 430,
    "answers": ["D", "C", "B", "D", "A"]
  },
  {
    "materials": "WaterCycle",
    "title": "Water Cycle",
    "description": "Control the path of a drop of water as it travels through the water cycle. Many alternatives are presented at each stage. Determine how the water moves from one location to another, and learn how water resources are distributed in these locations.",
    "resource": 435,
    "answers": ["B", "D", "C", "A", "A"]
  },
  {
    "materials": "PondEcosystem",
    "title": "Pond Ecosystem",
    "description": "Measure the temperature and oxygen content of a pond over the course of a day. Then go fishing to see what types of fish live in the pond. Many different ponds can be investigated to determine the influence of time, temperature, and farms on oxygen levels.",
    "resource": 664,
    "answers": ["A", "C", "B", "D", "B"]
  },
  {
    "description": "Use data from up to three weather stations to predict the motion of a hurricane. The wind speed, wind direction, cloud cover and air pressure are provided for each station using standard weather symbols.",
    "materials": "HurricaneMotionMetric",
    "title": "Hurricane Motion - Metric",
    "resource": 619,
    "answers": ["C", "B", "D", "A", "B"]
  },
  {
    "description": "Within this simulated region of land, daytime's rising temperature and the falling temperature at night can be measured, along with heat flow in and out of the system. The amount of greenhouse gases present in the atmosphere can be adjusted through time, and the long-term effects can be investigated.",
    "materials": "GreenhouseEffectS",
    "title": "Greenhouse Effect - Metric",
    "resource": 617,
    "answers": ["B", "C", "C", "A", "C"]
  },
  {
    "title": "Nitrogen Cycle STEM Case",
    "resource": 3084,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "title": "Ocean Carbon Equilibrium STEM Case",
    "resource": 3164,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "description": "Follow the path of a carbon atom through the atmosphere, biosphere, hydrosphere, and geosphere. Manipulate a simplified model to see how human activities and other factors affect the amount of atmospheric carbon today and in the future.",
    "materials": "CarbonCycle",
    "title": "Carbon Cycle",
    "resource": 1061,
    "answers": ["B", "C", "D", "D", "A"]
  },
  {
    "description": "Try to classify a dozen different rock samples based on their appearance. Common characteristics of each major rock type are described. Rocks also can be classified by where they formed.",
    "materials": "RockClassification",
    "title": "Rock Classification",
    "resource": 437,
    "answers": ["C", "B", "B", "C", "D"]
  },
  {
    "description": "Explore the abiotic factors that affect Caribbean coral reefs. Many factors can be manipulated in this simplified reef model, including ocean temperature and pH, storm severity, and input of excess sediments and nutrients from logging, sewage, and agriculture. Click \"Advance year\" to see how the reef responds to these changes.",
    "materials": "CoralReef1",
    "title": "Coral Reefs 1 - Abiotic Factors",
    "resource": 1056,
    "answers": ["A", "B", "C", "D", "D"]
  },
  {
    "materials": "PenumbraEffect",
    "title": "Penumbra Effect",
    "description": "Observe the partial shadows cast by a rectangular block lit by multiple light sources. The number of light sources ranges from one to five, and individual lights can be turned on or off. The light spacing, block width, and distance from the lights to the block can be varied. Light intensity can be observed on a detector.",
    "resource": 469,
    "answers": ["B", "A", "B", "C", "D"]
  },
  {
    "description": "In this followup to the Coral Reefs 1 - Abiotic Factors activity, investigate the impacts of fishing, disease, and invasive species on a model Caribbean coral reef. Many variables can be manipulated, included intensity of fishing, presence of black band and white band disease, and the presence of actual and potential invasive species. Click \"Advance year\" to see the impacts of these biotic changes.",
    "materials": "CoralReefs2",
    "title": "Coral Reefs 2 - Biotic Factors",
    "resource": 1059,
    "answers": ["D", "A", "B", "B", "D"]
  },
  {
    "description": "Pour water on a variety of sediment samples to find how much water can be absorbed by the sample (porosity) and how easily water flows through the sample (permeability).",
    "materials": "Porosity",
    "title": "Porosity",
    "resource": 431,
    "answers": ["C", "A", "C", "A", "C"]
  },
  {
    "description": "Explore the causes of convection by heating liquid and observing the resulting motion. The location and intensity of the heat source (or sources) can be varied, as well as the viscosity of the liquid. Use a probe to measure temperature and density in different areas and observe the motion of molecules in the liquid. Then, explore real-world examples of convection cells in Earth's mantle, oceans, and atmosphere.",
    "materials": "ConvectionCells",
    "title": "Convection Cells",
    "resource": 1090,
    "answers": ["B", "B", "C", "A", "D"]
  },
  {
    "materials": "RelativeHumidity",
    "title": "Relative Humidity",
    "description": "Measure the temperature on wet and dry bulb thermometers to determine relative humidity. Measure the dew point by cooling a bucket of water until condensation forms on the surface. See how the relative humidity and dew point change over the course of a day.",
    "resource": 425,
    "answers": ["B", "D", "B", "D", "B"]
  },
  {
    "materials": "HouseholdEnergy",
    "title": "Household Energy Usage",
    "description": "Explore the energy used by many household appliances, such as television sets, hair dryers, lights, computers, etc. Make estimates for how long each item is used on a daily basis to get an estimate for the total power consumed during a day, a week, a month, and a year, and how that relates to consumer costs and environmental impact.",
    "resource": 444,
    "answers": ["D", "A", "B", "D", "A"]
  },
  {
    "description": "Use genetic engineering techniques to create corn plants resistant to insect pests or tolerant of herbicides. Identify useful genes from bacteria, insert the desired gene into a corn plant, and then compare the modified plant to a control plant in a lab setting.",
    "materials": "GeneticEngineering",
    "title": "Genetic Engineering",
    "resource": 1072,
    "answers": ["B", "C", "B", "D", "C"]
  },
  {
    "description": "Understand how topographic maps work by creating a three-dimensional landscape and observing the corresponding contour lines. See how mountains, depressions, valleys and cliffs are represented on topographic maps. Fill in the landscape with water to demonstrate that contours are lines of constant elevation.",
    "materials": "ReadingTopoMaps",
    "title": "Reading Topographic Maps",
    "resource": 471,
    "answers": ["B", "A", "D", "C", "B"]
  },
  {
    "description": "In this follow-up to the Genetic Engineering Gizmo, explore how farmers can maximize yield while limiting ecosystem damage using genetically modified corn. Choose the corn type to plant and the amount of herbicide and insecticide to use, then measure corn yields and monitor wildlife populations and diversity. Observe the long-term effects of pollutants on a nearby stream ecosystem.",
    "materials": "GMOSEnvironment",
    "title": "GMOs and the Environment",
    "resource": 1073,
    "answers": ["C", "B", "D", "C", "D"]
  },
  {
    "description": "Design a car to protect a test dummy in a collision. Adjust the length and stiffness of the crumple zone and the rigidity of the safety cell to determine how the car will deform during the crash. Add seat belts and/or airbags to prevent the dummy from hitting the steering wheel. Three different body types (sedan, SUV, and subcompact) are available and a wide range of crash speeds can be used.",
    "materials": "CrumpleZones",
    "title": "Crumple Zones",
    "resource": 1078,
    "answers": ["C", "A", "B", "C", "A"]
  },
  {
    "materials": "DigestiveSystem",
    "title": "Digestive System",
    "description": "Digestion is a complex process, involving a wide variety of organs and chemicals that work together to break down food, absorb nutrients, and eliminate wastes. But have you ever wondered what would happen if some of those organs were eliminated, or if the sequence was changed? Can the digestive system be improved? Find out by designing your own digestive system with the Digestive System Gizmo.",
    "resource": 1050,
    "answers": ["C", "B", "C", "A", "D"]
  },
  {
    "materials": "Trebuchet",
    "title": "Trebuchet",
    "description": "Design your own trebuchet to fling a projectile at a castle wall. All of the dimensions of the trebuchet can be adjusted, as well as the masses of the counterweight and payload. Select a target on the Launch tab, or just see how far your projectile will go.",
    "resource": 1054,
    "answers": ["C", "D", "A", "D", "B"]
  },
  {
    "materials": "TripleBeam",
    "title": "Triple Beam Balance",
    "description": "Learn how to determine the mass of an object using a triple beam balance. The mass of a variety of objects can be determined using this simulated version of a common real-world laboratory tool for measurement.",
    "resource": 385,
    "answers": ["D", "B", "B", "B", "A"]
  },
  {
    "materials": "Circuits",
    "title": "Circuits",
    "description": "Build electrical circuits using batteries, light bulbs, resistors, fuses, wires, and a switch. An ammeter, a voltmeter and an ohmmeter are available for measuring current, voltage and resistance throughout the circuit. The voltage of the battery and the precision of the meters can be adjusted. Multiple circuits can be built for comparison.",
    "resource": 398,
    "answers": ["A", "B", "C", "C", "D"]
  },
  {
    "description": "Observe and measure the properties of a mineral sample, and then use a key to identify the mineral. Students can observe the color, luster, shape, density, hardness, streak, and reaction to acid for each mineral. There are 26 mineral samples to identify.",
    "materials": "MineralIdentification",
    "title": "Mineral Identification",
    "resource": 640,
    "answers": ["C", "C", "A", "A", "D"]
  },
  {
    "description": "See how muscles, bones, and connective tissue work together to allow movement. Observe how muscle contraction arises from the interactions of thin and thick filaments in muscle cells. Using what you have learned, construct an arm that can lift a weight or throw a ball. Connective tissue, muscle composition, bone length, and tendon insertion point can all be manipulated to create an arm to lift the heaviest weight or throw a ball the fastest.",
    "materials": "MusclesBones",
    "title": "Muscles and Bones",
    "resource": 1089,
    "answers": ["B", "C", "B", "A", "B"]
  },
  {
    "materials": "GraphingSkills",
    "title": "Graphing Skills",
    "description": "Create a graph (bar graph, line graph, pie chart, or scatter plot) based on a given data set. Title the graph, label the axes, and choose a scale. Adjust the graph to fit the data, and then check your accuracy. The Gizmo can also be used to create a data table based on a given graph.",
    "resource": 630,
    "answers": ["D", "D", "C", "C", "B"]
  },
  {
    "description": "Explore a wide variety of cells, from bacteria to human neurons, using a compound light microscope. Select a sample to study, then focus on the sample using the coarse and fine focus controls of the microscope. Compare the structures found in different cells, then perform tests to see if the sample is alive.",
    "materials": "CellTypes",
    "title": "Cell Types",
    "resource": 1066,
    "answers": ["B", "B", "D", "B", "D"]
  },
  {
    "materials": "WeatherMapsMetric",
    "title": "Weather Maps - Metric",
    "description": "Learn about standard symbols used in meteorology to construct weather maps. Rain, sleet, snow, temperature, cloud cover, wind speed and direction, and atmospheric pressure can all be recorded at two different weather stations on a map. Describe weather patterns characteristic of high-pressure systems, low-pressure systems, warm fronts, and cold fronts.",
    "resource": 618,
    "answers": ["D", "C", "B", "D", "A"]
  },
  {
    "description": "Use the Unit Conversions Gizmo to explore the concepts of scientific notation and significant digits. Convert numbers to and from scientific notation. Determine the number of significant digits in a measured value and in a calculation.",
    "materials": "UnitConversions2",
    "title": "Unit Conversions 2 - Scientific Notation and Significant Digits",
    "resource": 1052,
    "answers": ["C", "A", "C", "C", "B"]
  },
  {
    "materials": "MeasuringVolume",
    "title": "Measuring Volume",
    "description": "Measure the volume of liquids and solids using beakers, graduated cylinders, overflow cups, and rulers. Water can be poured from one container to another and objects can be added to containers. A pipette can be used to transfer small amounts of water, and a magnifier can be used to observe the meniscus in a graduated cylinder. Test your volume-measurement skills in the \"Practice\" mode of the Gizmo.",
    "resource": 1048,
    "answers": ["C", "B", "C", "A", "A"]
  },
  {
    "description": "Use a variety of real-world lab tests to analyze common food samples in order to determine if the food is a carbohydrate, a protein, or a lipid. Tests that can be performed include: Benedict, Lugol, Biuret, and Sudan Red.",
    "materials": "IdentifyingNutrients",
    "title": "Identifying Nutrients",
    "resource": 452,
    "answers": ["B", "C", "A", "C", "A"]
  },
  {
    "description": "Where does energy come from? How does energy get from one place to another? Find out how electrical current is generated and how living things get energy to move and grow. Trace the path of energy and see how energy is converted from one form to another.",
    "materials": "EnergyConversions",
    "title": "Energy Conversions",
    "resource": 651,
    "answers": ["C", "D", "B", "A", "B"]
  },
  {
    "description": "Use unit conversion tiles to convert from one unit to another. Tiles can be flipped to cancel units. Convert between metric units or between metric and U.S. customary units. Solve distance, time, speed, mass, volume, and density problems.",
    "materials": "UnitConversion",
    "title": "Unit Conversions",
    "resource": 1051,
    "answers": ["A", "C", "B", "C", "B"]
  },
  {
    "materials": "PhasedArray",
    "title": "Phased Array",
    "description": "Observe the wave fronts produced by four closely-spaced emitters. The spacing and phase shift of each wave source can be adjusted, as well as the wave velocity. With all four sources you can observe a region of constructive interference that moves over time. The phased array has several real world applications such as radar and ultrasound.",
    "resource": 590,
    "answers": ["C", "C", "B", "C", "A"]
  },
  {
    "description": "Test the acidity of common substances using pH paper. Materials including soap, lemon juice, milk, and oven cleaner can be tested by comparing the color of pH strips to a standard scale.",
    "materials": "pHAnalysis",
    "title": "pH Analysis",
    "resource": 432,
    "answers": ["D", "C", "B", "B", "B"]
  },
  {
    "description": "Understand the definition of a mole and determine the Avogadro constant by adding atoms or formula units to a balance until the mass in grams is equal to the atomic or formula mass. Manipulate a conceptual model to understand how the number of particles, the number of moles, and the mass are related. Then use dimensional analysis to convert between particles, moles, and mass.",
    "materials": "Moles",
    "title": "Moles",
    "resource": 1084,
    "answers": ["D", "B", "D", "D", "B"]
  },
  {
    "materials": "PatternFinder",
    "title": "Pattern Finder",
    "description": "Observe frogs jumping around on colored lily pads. Find, test, and reason about patterns you see in their jumping.",
    "resource": 663,
    "answers": ["A", "C", "A", "D", "B"]
  },
  {
    "description": "Grow Wisconsin Fast Plants® in a simulated lab environment. Explore the life cycles of these plants and how their growth is influenced by light, water, and crowding. Practice pollinating the plants using bee sticks, then observe the traits of the offspring plants. Use Punnett squares to model the inheritance of genes for stem color and leaf color for these plants.",
    "materials": "FastPlants1",
    "title": "Fast Plants� 1 - Growth and Genetics",
    "resource": 1085,
    "answers": ["B", "D", "D", "A", "C"]
  },
  {
    "description": "In this follow-up to Fast Plants® 1 - Growth and Genetics, continue to explore inheritance of traits in Wisconsin Fast Plants. Infer the genotype of a \"mystery P2 parent\" of a set of Fast Plants based on the traits of the P1, F1, and F2 plants. Then create designer Fast Plants by selectively breeding plants with desired traits.",
    "materials": "FastPlants2",
    "title": "Fast Plants� 2 - Mystery Parent",
    "resource": 1087,
    "answers": ["B", "A", "C", "B", "C"]
  },
  {
    "description": "Investigate the growth of three common garden plants: tomatoes, beans, and turnips. You can change the amount of light each plant gets, the amount of water added each day, and the type of soil the seed is planted in. Observe the effect of each variable on plant height, plant mass, leaf color and leaf size. Determine what conditions produce the tallest and healthiest plants. Height and mass data are displayed on tables and graphs.",
    "materials": "GrowingPlants",
    "title": "Growing Plants",
    "resource": 615,
    "answers": ["D", "B", "B", "C", "C"]
  },
  {
    "description": "Study photosynthesis in a variety of conditions. Oxygen production is used to measure the rate of photosynthesis. Light intensity, carbon dioxide levels, temperature, and wavelength of light can all be varied. Determine which conditions are ideal for photosynthesis, and understand how limiting factors affect oxygen production.",
    "materials": "PhotosynthesisLab",
    "title": "Photosynthesis Lab",
    "resource": 395,
    "answers": ["B", "D", "A", "B", "C"]
  },
  {
    "description": "Test the acidity of many common everyday substances using pH paper (four color indicators). Materials including soap, lemon juice, milk, and oven cleaner can be tested by comparing the color of the pH strips to the calibrated scale.",
    "materials": "pHQuadColor",
    "title": "pH Analysis: Quad Color Indicator",
    "resource": 458,
    "answers": ["D", "C", "B", "B", "B"]
  },
  {
    "description": "Practice measuring the period of a pendulum. Perform experiments to determine how mass, length, gravitational acceleration, and angle affect the period of a pendulum.",
    "materials": "PeriodPendulum",
    "title": "Period of a Pendulum",
    "resource": 391,
    "answers": ["C", "B", "B", "A", "B"]
  },
  {
    "materials": "ReverseField",
    "title": "Reverse the Field",
    "description": "Measure the time required to write a word when the mouse behaves in a normal fashion and when the direction of motion is reversed from left to right, up to down, or both. Run several experiments in each mode to see if your brain and muscles are able to adapt to the new direction of motion. Determine which type of inversion is easiest to adjust to and whether you can train yourself to function normally when the inversion is present.",
    "resource": 40,
    "answers": ["A", "B", "B", "D", "D"]
  },
  {
    "description": "Try to click your mouse once every 2 seconds. The time interval between each click is recorded, as well as the error and percent error. Data can be displayed in a table, histogram, or scatter plot. Observe and measure the characteristics of the resulting distribution when large amounts of data are collected.",
    "materials": "RealTimeHistogram",
    "title": "Real-Time Histogram",
    "resource": 602,
    "answers": ["A", "C", "B", "C", "B"]
  },
  {
    "description": "Try to estimate the passage of time by selecting a time interval, clicking the Start button, and clicking Stop when you think the interval has passed. The estimate and percent error are recorded. Compare different techniques for estimating time, as well as the average error for long time intervals versus shorter intervals.",
    "materials": "TimeEstimation",
    "title": "Time Estimation",
    "resource": 50,
    "answers": ["C", "B", "A", "D", "A"]
  },
  {
    "description": "Have you ever used a glove warmer to keep your hands warm? How about an instant cold pack to treat an injury? In the Feel the Heat Gizmo, create your own hot and cold packs using various salts dissolved in water and different bag materials. Learn about exothermic and endothermic processes and how energy is absorbed or released when bonds are broken and new bonds form.",
    "materials": "FeeltheHeat",
    "title": "Feel the Heat",
    "resource": 1083,
    "answers": ["C", "D", "C", "B", "A"]
  },
  {
    "materials": "Fingerprinting",
    "title": "Fingerprinting",
    "description": "Collect fingerprints from simulated crime scenes using a camera, fingerprinting powder, and tape. Classify fingerprints into groups and subgroups, then identify minutiae. Match collected prints to the fingerprints of suspects to identify who left prints at the scene of the crime.",
    "resource": 1098,
    "answers": ["A", "C", "B", "C", "D"]
  },
  {
    "materials": "PendulumClock",
    "title": "Pendulum Clock",
    "description": "Find the effect of length, mass, and angle on the period of a pendulum. The pendulum is attached to a clock that can be adjusted to tell time accurately. The clock can be located on Earth or Jupiter to determine the effect of gravity.",
    "resource": 645,
    "answers": ["C", "B", "C", "C", "D"]
  },
  {
    "title": "Electrons and Chemical Reactions STEM Case",
    "resource": 3134,
    "description": "",
    "materials": "",
    "answers": []
  },
  {
    "description": "Learn how DNA is compared to identify individuals. Identify the sections of DNA that tend to differ and use PCR to amplify these segments. Then use gel electrophoresis to create DNA profiles. Based on what you have learned, create your own DNA profiling test and use this test to analyze crime scene evidence.",
    "materials": "DNAProfiling",
    "title": "DNA Profiling",
    "resource": 1092,
    "answers": ["B", "D", "B", "C", "A"]
  },
  {
    "materials": "SightSoundReactions",
    "title": "Sight vs. Sound Reactions",
    "description": "Measure your reaction time by clicking your mouse as quickly as possible when visual or auditory stimuli are presented. The individual response times are recorded, as well as the mean and standard deviation for each test. A histogram of data shows overall trends in sight and sound response times. The type of test as well as the symbols and sounds used are chosen by the user.",
    "resource": 43,
    "answers": ["B", "A", "D", "B", "A"]
  },
  {
    "description": "Perform multiple experiments using several common powders such as corn starch, baking powder, baking soda, salt, and gelatin. The results of the research on the known powders can then be used to analyze several unknowns using the scientific method. The unknowns can be a single powder or a combination of the known powders.",
    "materials": "MysteryPowder",
    "title": "Mystery Powder Analysis",
    "resource": 433,
    "answers": ["C", "B", "B", "C", "D"]
  },
  {
    "title": "Air Track",
    "materials": "AirTrack",
    "description": "Adjust the mass and velocity of two gliders on a frictionless air track. Measure the velocity, momentum, and kinetic energy of each glider as they approach each other and collide. Collisions can be elastic or inelastic.",
    "resource": 12,
    "answers": ["D", "C", "B", "A", "C"]
  },
  {
    "title": "JSON",
    "materials": "JSON",
    "description": "Say hello to JSON!",
    "resource": 1,
    "answers": [".", "J", "S", "O", "N"]
  }
]
